{
  "peca kya hai": "PECA‑2016 (Prevention of Electronic Crimes Act) is Pakistan's main cybercrime law. It covers digital blackmail (Section 21), privacy violations (Section 20), child pornography (Section 22), grooming (Section 22A), cyberstalking (Section 24), identity theft (Section 20), impersonation, hacking, spamming, and more. Penalties range from fines to many years of prison depending on the offense.",
  "peca meaning": "PECA stands for Prevention of Electronic Crimes Act‑2016, introduced to tackle online threats—harassment, fake accounts, defamation, hacking.",
  "pika law": "PECA is Pakistan’s cyber‑crime law. It covers digital blackmail, privacy misuse, identity theft—with fines up to PKR 5 million and prison terms.",
  "pakistan cyber law": "In Pakistan, cybercrime is governed by PECA‑2016. Complaints are handled by NCCIA (formerly FIA Cyber Wing), established under Section 51 of PECA.",
  "phishing": "Phishing is a type of cyber attack where attackers impersonate trusted entities to steal sensitive information.",
  "2fa": "Two‑Factor Authentication (2FA) adds an extra layer of protection beyond just a username and password.",
  "malware": "Malware is software designed to harm or exploit systems.",
  "vpn": "VPNs encrypt your traffic and hide your location. They help protect you from tracking.",
  "encryption": "Encryption turns your data into unreadable code. It’s used in messaging apps to protect your chats.",
  "firewall": "A firewall blocks malicious traffic from entering your system. It’s essential for cybersecurity.",
  "how to report cybercrime": "To report cybercrime, call the NCCIA/FIA helpline 1991 (or 051‑9106691 for NCCIA), email cybercrime@fia.gov.pk or helpdesk@nccia.gov.pk, visit a CCRC office, or use the FIA online portal. Always include digital evidence like screenshots, URLs, dates, and your CNIC.",
  "report to fia": "To report, call 1991 or email the NCCIA with evidence (screenshots, URLs) and your identity document to initiate investigation.",
  "fia complaint": "Gather evidence like screenshots, chat logs, URLs. Then call 1991 or visit the NCCIA/FIA site to file your complaint officially.",
  "file cyber crime report": "You can file via 1991 helpline or email cybercrime@fia.gov.pk. After submission you receive a tracking number—keep it safe.",
  "i am being blackmailed": "If someone is blackmailing you online (for example threatening to leak images or chats unless you pay), this is illegal under PECA Section 21 (revenge porn/sextortion). Save messages, never pay, and report it immediately to NCCIA—call 1991 or email cybercrime@fia.gov.pk.",
  "online blackmail": "Online blackmail—threats to leak photos, chats—is illegal under PECA Section 21. Report to NCCIA immediately with proof.",
  "blackmail law pakistan": "Digital blackmail is a serious offense—punishable under PECA Section 21 with up to 7 years in jail and fines up to PKR 5 million.",
  "online harassment": "Persistent threats, unwanted messages, or exposing your content is harassment under PECA Section 24/24A—file a complaint with NCCIA.",
  "harassment complaint": "To lodge a harassment complaint, contact NCCIA via 1991 or email. Save chat records and URLs as evidence.",
  "privacy violation": "Sharing private messages, photos or data without consent is a violation under PECA Section 20—file a complaint with evidence like screenshots.",
  "leaked photo": "If your private photo was shared without permission, it's a violation under PECA Section 21—report to NCCIA, save proof (timestamps, origin).",
  "someone shared my chats": "Publishing private messages is illegal under PECA Section 20. Compile screenshots and report to NCCIA for investigation.",
  "identity theft": "Using someone else’s name or photo online is identity theft under PECA Section 20 and PPC Section 378. Report with evidence.",
  "fake profile": "Creating a fake profile is identity theft under PECA Section 20. Take screengrabs, report it to NCCIA with evidence, and request account removal.",
  "impersonation online": "Online impersonation is a punishable offense. Save proof and report to NCCIA/FIA to have the account removed.",
  "deepfake": "Creating/sharing deepfake content of others without their consent is illegal under PECA Section 20/21—report it.",
  "revenge porn": "Revenge porn is a serious crime under PECA Section 21. You can face imprisonment up to 7 years. Seek help from NCCIA or DRF.",
  "sextortion": "Threats to leak explicit content unless demands are met is sextortion—file an urgent report under PECA Section 21.",
  "i am being groomed online": "Online grooming—when an adult befriends a minor to exploit them—is explicitly illegal under PECA Section 22A (5–10 years prison). Block and report immediately.",
  "what is grooming": "Grooming is building trust to exploit sexually. Under PECA Section 22A, this is a severe offense punishable by 5–10 years in jail.",
  "underage nudes law": "Any sexual content involving someone under 18 is child pornography under PECA Section 22. Permissible age is 18+ only.",
  "is sexting legal in pakistan": "Sexting is only legal if both parties are over 18. If one or both are minors, it's illegal under PECA Section 22—even if consensual.",
  "i'm 18 and she's 17 can we sext": "No. In Pakistan, anyone under 18 is a minor. Sharing explicit content with them is illegal—even with consent.",
  "he said it was a joke": "Even ‘jokes’ asking a minor for sexual content is illegal under PECA Section 22A. Report these incidents.",
  "fake account using my name": "Creating a fake account using someone’s name or photos is identity theft under PECA Section 20. Gather evidence and report it.",
  "someone posted my number on a meme page": "Sharing personal info like phone number without consent violates privacy under PECA Section 20. Report to NCCIA.",
  "they leaked my number on insta": "Publicizing your number is a crime. Take screenshots and report under PECA Section 20.",
  "i cannot afford a lawyer": "You don’t need a private lawyer—DRF, AGHS Legal Aid, and many NGOs offer free legal support for cybercrime victims.",
  "i'm ashamed": "Feeling ashamed is normal—but these crimes are **not your fault**. You can get confidential support from DRF (0800‑39393), and you can file complaints anonymously.",
  "i can't tell parents": "If you can’t tell parents, call DRF helpline (0800‑39393) for anonymous, confidential guidance.",
  "my parents strict": "If your parents are strict and you’re scared to tell them, you can still get help confidentially through DRF helpline (0800‑39393), or report anonymously via NCCIA/FIA.",
  "zainab case reference": "In the 2018 Zainab Ansari case, FIA/NCCIA used digital forensics to catch the perpetrator—this shows online crimes are taken extremely seriously.",
  "child porn law pakistan": "Under PECA Section 22, child porn (nude photos/videos of anyone under 18) is a crime. Penalty ranges from 14–20 years in jail and up to PKR 1 million fine.",
  "nccia powers": "NCCIA, established May 3, 2024 under PECA Section 51, has investigative powers—collecting evidence, blocking illegal content, digital forensics, making arrests.",
  "court privacy": "Trials involving minors or sexual offenses are held in-camera under PECA Section 30C to protect victims’ identities.",
  "reddit advice": "Reddit users often recommend saving evidence, avoiding further public posting, and contacting NCCIA. One wrote: “Your only option here is contacting legal authorities ... You’re not alone.”",
  "my parents found out": "If your family finds out, stay calm. NGOs like DRF can help you navigate this without making things worse at home.",
  "i'm scared to tell parents": "It’s okay to be scared. You can still get help anonymously from DRF or NCCIA without involving your family.",
  "my parents are strict and controlling": "If you fear backlash, prioritize your safety. Use hotlines like DRF 0800-39393 to get confidential support.",
  "embarrassed about sharing": "You’re not alone, many feel embarrassed. Remember, the crime is not yours, seek help from trusted organizations.",
  "friend shared my secret online": "Sharing your private info without consent is illegal. Collect evidence and report immediately.",
  "someone is threatening me online": "Threats are a crime. Save all messages, take screenshots, and report to NCCIA.",
  "my ex is stalking me online": "Stalking is punishable under PECA. Block the person and report to authorities with proof.",
  "i received fake calls and messages": "Keep records of calls and messages. Report to FIA for investigation.",
  "my account got hacked": "Change passwords immediately, enable 2FA, and report hacking to FIA.",
  "i was scammed online": "Stop all communication with scammers, save chat logs, and report the fraud to NCCIA.",
  "someone posted my photos without consent": "Posting private photos without permission is illegal. Report and request removal immediately.",
  "online bullying is ruining me": "Cyberbullying is punishable. Save evidence, block bullies, and file a complaint.",
  "i want to keep my identity private": "You can report anonymously via NGOs or FIA helplines. Your safety is priority.",
  "how long does investigation take": "It varies by case, but having strong evidence speeds up the process.",
  "can i get free legal help?": "Yes, organizations like DRF and AGHS Foundation provide free legal aid to victims.",
  "what if they find out i reported?": "Reporting can be anonymous and confidential. Your safety is protected by law.",
  "how to protect myself online": "Use strong passwords, avoid sharing personal info, enable 2FA, and be cautious with strangers.",
  "what is grooming online": "Grooming is when an adult builds trust with a minor for exploitation; it’s illegal and punishable.",
  "what is sextortion": "Sextortion is blackmail using explicit images/videos, never pay and report immediately.",
  "can minors report cybercrime?": "Yes, anyone can report, and help is available specifically for minors.",
  "i feel depressed and alone": "Seek help from counselors or NGOs. You’re not alone and support is available.",
  "i fear retaliation": "Your safety is priority; seek help confidentially and do not confront the offender alone.",
  "how to gather evidence": "Save screenshots, record URLs, note dates and times, and keep chat logs.",
  "how to delete my digital footprint": "Limit sharing info online, adjust privacy settings, and request content removal from platforms.",
  "what is a fake profile": "A profile pretending to be you or someone else, often used to harass or scam.",
  "how to report fake profiles": "Report to the platform and also file a complaint with NCCIA with proof.",
  "how to deal with online trolls": "Block, report, and don’t engage. Save evidence if threats are made.",
  "can i sue for cyber harassment": "Yes, under PECA you can file complaints and take legal action.",
  "my phone got hacked": "Disconnect from internet, run antivirus, and seek expert help immediately.",
  "someone shared my number": "Sharing your personal contact without consent is illegal, report with proof.",
  "what is digital blackmail": "Using threats to leak private info or images to extort money or favors.",
  "how to protect my privacy": "Use encryption, VPNs, strong passwords, and be cautious with sharing info.",
  "how to handle online defamation": "Save proof of false statements and file a complaint with authorities.",
  "what to do if threatened online": "Save all evidence, block the sender, and report immediately.",
  "how to handle online scams": "Never share personal info with unknown contacts and report suspicious activity.",
  "how to stay safe on social media": "Use privacy settings, don’t accept unknown friend requests, and avoid oversharing.",
  "what is phishing attack": "Fake emails or messages trying to steal your passwords or financial info.",
  "how to avoid phishing": "Don’t click suspicious links, verify sender details, and use antivirus software.",
  "what is malware": "Malicious software designed to damage or gain unauthorized access to your device.",
  "how to avoid malware": "Don’t download from unknown sources and keep software updated.",
  "can i get legal aid without lawyer": "Yes, NGOs provide free legal advice and support.",
  "how to report child pornography": "Immediately report to FIA and NCCIA with any evidence.",
  "what to do if cybercrime police don’t help": "Contact NGOs for support or escalate the case with FIA higher officials.",
  "how to keep evidence safe": "Store screenshots and files securely, backup in multiple places.",
  "can i delete evidence after reporting": "No, keep it until case is resolved.",
  "what is cyberstalking": "Repeated online harassment or surveillance causing distress.",
  "how to prove cyberstalking": "Save all messages, screenshots, timestamps, and URLs.",
  "how to block stalkers online": "Use platform tools to block and report stalkers.",
  "what is online grooming": "Adults befriending minors online for exploitative purposes, illegal under PECA.",
  "how to recognize grooming": "Excessive attention, requests for secrets, or inappropriate conversation.",
  "what to do if groomed": "Block, report, and seek help from trusted adults or authorities.",
  "what is revenge porn": "Sharing explicit images without consent to harm the victim.",
  "how to get revenge porn removed": "Report to platform, file complaint with authorities.",
  "can cybercrime cases be anonymous": "Yes, many helplines and NGOs allow anonymous reporting.",
  "how to report online harassment anonymously": "Use NGO helplines like DRF or submit anonymous complaints to FIA.",
  "can minors be protected legally": "Yes, Pakistani laws protect minors from cyber exploitation.",
  "can family block my report": "No, the law protects victim rights regardless of family opinion.",
  "how to handle social media bullying": "Block bullies, save evidence, report to platform and authorities.",
  "what is phishing scam": "Tricking you into giving passwords or banking info by pretending to be legit.",
  "how to identify phishing": "Check email sender, suspicious links, grammatical errors.",
  "what is cyberbullying": "Using digital media to harass or intimidate others repeatedly.",
  "how to prove cyberbullying": "Keep screenshots and record messages or calls.",
  "what penalties for cybercrime": "Fines, imprisonment from 3 years to 20 years depending on offense.",
  "can cybercriminals be extradited": "Yes, Pakistan cooperates internationally for cybercrime.",
  "what to do if my friend is victim": "Encourage them to report and support them emotionally.",
  "how to protect children online": "Use parental controls, educate about dangers, monitor activity.",
  "can cybercrime evidence be faked": "Yes, but forensic experts verify authenticity in court.",
  "how long do cybercrime cases last": "Depends on complexity but usually months to years.",
  "can social media companies delete content": "Yes, upon request or court order.",
  "what is cyber defamation": "Spreading false info to harm reputation online.",
  "how to handle cyber defamation": "File complaint with evidence, request takedown.",
  "how to protect passwords": "Use unique, complex passwords and password managers.",
  "what is digital forensics": "Recovering and investigating digital evidence for cases.",
  "can i report cybercrime in person": "Yes, visit your local FIA or CCRC office.",
  "are screenshots valid evidence": "Yes, accepted in courts but best if certified.",
  "how to get restraining order online": "Apply through court with legal aid support.",
  "can cybercrime be solved quickly": "Depends on evidence and case load.",
  "do police understand cybercrime": "FIA and NCCIA have specialized cybercrime units.",
  "what if offender is foreign": "Cases may involve international law enforcement cooperation.",
  "is sexting a crime": "If minors involved, yes; adults consensual is not.",
  "what is cyber extortion": "Demanding money or favors by threatening to expose info.",
  "can i file complaint without cnic": "Usually required but NGOs may assist otherwise.",
  "how to protect my kids online": "Educate, monitor, set rules, use safe apps.",
  "how to delete old social media posts": "Manually delete or request platforms.",
  "can cybercrime victims get compensation": "Sometimes through courts, complicated process.",
  "what is cybercrime hotline": "1991 is FIA/NCCIA cybercrime helpline in Pakistan.",
  "my parents found out about my online chats": "If your parents found out and you’re scared, stay calm. Explain you need support and contact DRF helpline (0800-39393) for advice on how to handle family pressure.",
 "parents strict and don't allow phone use": "If parents are strict, use anonymous helplines like DRF or talk to trusted relatives or teachers for support without exposing yourself too much.",  "embarrassed to tell parents about cyber harassment": "Feeling embarrassed is normal but remember you’re not alone. Confidential help is available through NGOs like DRF who respect your privacy.",
  "how to explain cyber harassment to conservative parents": "Try focusing on safety and legal facts. NGOs can provide guidance on explaining without causing family drama.",
  "parents blaming me for harassment": "Victim blaming is common but wrong. Reach out to NGOs or counselors who can help you deal with family misunderstandings and protect your rights.",
  "afraid of parents punishing me after harassment": "Your safety matters most. Contact DRF or AGHS legal aid anonymously to plan your next steps safely.",
  "my family is forcing me to delete evidence": "Never delete evidence. This is your protection. Store copies safely and share with trusted NGOs or authorities.",
  "friends shaming me after harassment": "Real friends support you. If they don’t, distance yourself and find help through trusted support groups or online forums.",
  "my ex is threatening to leak my private photos": "This is revenge porn and illegal under PECA. Block them, save proof, and report immediately to NCCIA and DRF.",
  "how to block someone without them knowing": "Use platform tools to block silently and change your privacy settings to avoid contact.",
  "my phone got hacked and someone is sending messages pretending to be me": "Change all passwords ASAP, enable 2FA, notify your contacts about the hack, and report the incident to FIA.",
  "my friends shared my embarrassing photo without permission": "This violates your privacy rights. Ask them to remove it, and if they refuse, report to platform and authorities.",
  "i’m scared to use my phone now": "Take a break, update your security, and reach out for emotional support from helplines or counselors.",
  "someone is stalking me offline after online threats": "This is serious—inform police, document all incidents, and seek protection orders if possible.",
  "how to stay safe while using social media": "Keep accounts private, avoid sharing personal details, and report suspicious activity immediately.",
  "what to do if i feel depressed after online harassment": "Reach out to mental health professionals or NGOs like Rozan and DRF who offer counseling.",
  "how to get restraining orders in Pakistan": "You can apply through courts with legal aid from NGOs; they guide you through the process.",
  "can i stay anonymous while reporting": "Yes, many organizations and police units allow anonymous complaints to protect your identity.",
  "my parents don't believe me about online abuse": "Try to show them evidence calmly and get help from counselors or NGOs who can mediate.",
  "how to support a friend going through cyber harassment": "Listen without judgement, encourage evidence collection, and help them contact trusted NGOs or police.",
  "is it safe to confront my harasser": "Usually no, avoid confrontation alone and always involve authorities or trusted adults.",
  "what happens after i report cybercrime": "Authorities investigate, collect evidence, and if strong, they arrest and charge offenders under PECA.",
  "how long does cybercrime case take in Pakistan": "It varies; simple cases may resolve in months, complex ones can take years depending on evidence and courts.",
  "can cybercrime reports be rejected": "Yes, if insufficient evidence. That's why saving clear proof and legal support is key.",
  "i want to delete embarrassing posts made by others": "You can request platform takedown and file complaints under PECA for privacy violations.",
  "can social media block fake profiles": "Yes, they have reporting systems; report quickly and also inform NCCIA for legal action.",
  "my harasser created fake accounts about me": "Collect proof, report to platform and NCCIA for harassment and defamation claims.",
  "how to protect kids from online dangers": "Use parental controls, educate about safe internet use, and monitor their activity without invading privacy too much.",
  "i received threatening messages from unknown number": "Don’t ignore. Save messages, block number, and report to FIA/NCCIA immediately.",
  "how to recover hacked social media accounts": "Use platform recovery tools, change linked emails, enable 2FA, and report hacking to authorities.",
  "is sharing explicit photos online ever safe": "No, once online, control is lost. Avoid sharing and never with minors.",
  "what to do if my child is a victim of cybercrime": "Seek immediate help from FIA, NGOs, and child protection services. Document all evidence.",
  "how to identify grooming signs in children": "Unexplained secrecy, new online friends, withdrawal, or sudden gifts; educate and monitor carefully.",
  "are police trained for cybercrime": "Specialized units like NCCIA have trained officers but reporting to NGOs for legal advice is also helpful.",
  "can i report cybercrime via whatsapp": "Official reporting is through helplines and email; some NGOs provide WhatsApp support for guidance.",
  "how to find legal aid for cybercrime victims": "Contact DRF (0800-39393), AGHS Legal Aid, or other women’s rights organizations for free help.",
  "can i get restraining orders against online stalkers": "Yes, through courts with NGO support.",
  "what if cybercriminal is abroad": "Pakistan cooperates internationally; NCCIA can request extradition or legal assistance.",
  "how to protect passwords from being hacked": "Use strong, unique passwords, change regularly, and never share them.",
  "what to do if blackmail involves family members": "This complicates things but legal help is still available; NGOs can provide confidential support.",
  "how to deal with online defamation": "File complaints with social media platforms and authorities, save evidence, and seek legal advice.",
  "i’m worried about my mental health after cyber abuse": "Get counseling support ASAP from mental health NGOs or helplines.",
  "what apps can help protect online privacy": "Use Signal, Telegram with secret chats, password managers, and VPNs for better security.",
  "can cybercrime victims get compensation": "Sometimes courts award damages but legal processes can be long and complex.",
  "how to remove personal info from search engines": "Use platform removal requests and consider legal options if info is private and sensitive.",
  "can i block someone on all platforms easily": "Yes, but you must do it on each platform separately and adjust privacy settings for full protection.",
  "what is doxxing and is it illegal": "Publishing personal info online without consent to harass is doxxing and illegal under PECA.",
  "can online harassment affect my job": "Yes, especially if personal info or defamatory content spreads; report early to protect reputation.",
  "my cyberbully is a classmate": "Document everything, avoid confrontation, and report to school authorities and NCCIA.",
  "how to talk to parents about online harassment": "Be calm, show proof, and if needed, get help from counselors or trusted adults.",
  "what to do if i get revenge porn threats": "Don’t panic, save all evidence, block harasser, and report to FIA and NGOs immediately.",
  "how to help a minor who is being cyberbullied": "Encourage them to save evidence, block bullies, and seek support from school and NGOs.",
  "can i delete all my online presence": "Not completely, but you can minimize exposure by deleting accounts and limiting info shared.",
  "my harasser is using deepfake videos": "Report immediately to authorities; this is a serious offense with severe penalties.",
  "can i ask social media to take down fake videos/photos": "Yes, use platform reporting tools and legal complaints for quicker removal.",
  "how to protect myself from online scams": "Never share personal info with strangers, verify sources, and use official apps only.",
  "is online blackmail common in Pakistan": "Unfortunately yes, especially targeting women and minors. Stay vigilant and report fast.",
  "how to respond to online harassment without escalating": "Don’t respond emotionally, block, save evidence, and report through proper channels.",
  "my child is spending too much time online": "Set limits, encourage offline activities, and educate about internet risks.",
  "what is digital literacy": "Knowing how to use digital tech safely, spot scams, and protect privacy online.",
  "can I get support if my cybercrime case is dismissed": "Yes, NGOs can help appeal or offer counseling and alternative support.",
  "how to keep safe while using dating apps": "Verify identities, avoid sharing personal info early, and meet in public places.",
  "can police trace anonymous harassers": "Yes, digital forensics help track IPs and accounts to identify offenders.",
  "what is phishing and how to avoid": "Fake messages trying to steal info; never click suspicious links or share passwords.",
  "my account got suspended due to false report": "Appeal via platform support and report misuse of reporting tools to authorities.",
  "how to educate others about cyber safety": "Share info on social media, organize community talks, and support awareness NGOs.",
  "my workplace uses monitoring software": "Understand policies, keep work and personal online separate, and report privacy violations.",
  "how to set up 2FA": "Use apps like Google Authenticator or Authy for extra security on accounts.",
  "what to do if I feel overwhelmed by cyber threats": "Take breaks, talk to friends or counselors, and focus on self-care.",
  "how to safely delete old emails and messages": "Use secure deletion tools and clear storage regularly to prevent data leaks.",
  "parents are gaslighting me about the abuse": "They say 'yeh sab tumhari imagination hai' or 'phone chhodo, ye sab drama band karo' — but trust your gut, and reach out to DRF helpline 0800-39393 for real help.",
  "my friends are telling me to delete proof": "Friends can mess up sometimes. Don’t delete anything! Proof is your power. Save screenshots, dates, and forward to trusted NGOs.",
  "i'm scared to show my face on camera": "It's normal to feel anxious. Take your time. Use anonymous helplines or text-based counseling first.",
  "they are sharing my number in memes": "Ye bahut serious cheez hai. Sharing personal info without consent is illegal under PECA. Take screenshots, report to NCCIA ASAP.",
  "my family says 'why are you on phone so much' after harassment": "Family pressure is tough, but your safety comes first. Use safe apps and block abusers. NGOs can help explain this to your family too.",
  "how to spot a scam call pretending to be FIA": "FIA never asks for money on call. If they demand cash or personal info, hang up and report immediately.",
  "i get weird messages in roman urdu full of slang": "Ignore and block. Save messages if threatening, and share with cybercrime authorities.",
  "i’m constantly checking my phone because i’m scared of new threats": "That’s anxiety. Try limiting screen time and talk to mental health support like Rozan or Mind Matters Pakistan.",
  "deepfake videos of me got leaked": "This is criminal under PECA. Block accounts sharing it and report to FIA and DRF without delay.",
  "my harasser is sending msgs in fake dialects to confuse me": "Don’t engage, screenshot everything. Sometimes they try to confuse or scare you with slang or fake accents.",
  "someone hacked my insta and is posting fake stories": "Change your passwords immediately, enable 2FA, and report hacking to the platform and FIA cyber wing.",
  "parents caught me deleting chats": "Explain you’re protecting yourself. If it’s risky, talk to NGOs who can guide you on keeping evidence safe without causing family drama.",
  "my cyberbully is a classmate and school won’t help": "Document everything, involve your parents if safe, and report to NCCIA. School neglect doesn’t mean you’re helpless.",
  "my friends shared my embarrassing pic and called me 'larki gandi'": "This is bullying and harassment. Block, report, and seek support. You deserve respect, not shame.",
  "my parents want to control my phone after harassment": "They’re worried but trust is key. Show them you’re responsible but also get help from NGOs if it feels like control is too much.",
  "someone created a fake profile using my pics and slang i use": "This is identity theft. Collect proof and report immediately to platforms and NCCIA for removal and legal action.",
  "my ex is threatening to leak old chats on whatsapp": "Save screenshots, block him, and report for blackmail under PECA Section 21.",
  "i feel depressed and alone after online harassment": "You’re not alone. Contact mental health NGOs, counselors, or helplines like Rozan, and talk openly.",
  "my parents don’t believe me and say it’s my fault": "Victim blaming is wrong. Seek support from NGOs and legal aid, who can help you stand strong.",
  "how to explain cyber harassment to conservative family": "Focus on safety, privacy, and legal facts. NGOs have counselors who can mediate family talks confidentially.",
  "my harasser is sending messages full of local slang and threats": "Take screenshots, block, and report. Slang doesn’t make threats less serious.",
  "i’m scared to tell anyone because they’ll judge me": "Judgment hurts but your safety and justice come first. Helplines like DRF offer anonymous and safe support.",
  "i got called 'churail' and 'bewafa' online after breaking up": "Online abuse is harassment. Save evidence, block offenders, and report to authorities.",
  "they’re using fake accounts to spam me with insults": "Block and report every fake profile. Keep proof to show authorities for legal action.",
  "i’m exhausted from constant online threats and fear": "Take breaks, practice self-care, and get mental health support to cope with stress and trauma.",
  "someone posted my number on a meme page with mocking captions": "This violates privacy under PECA. Take screenshots, report to platform and NCCIA.",
  "parents forcing me to delete evidence to avoid family shame": "Protect yourself first. Save backups securely and talk to NGOs for advice on family-safe strategies.",
  "how to keep my digital footprint minimal and safe": "Use strong passwords, enable 2FA, avoid oversharing, and regularly check privacy settings on apps.",
  "my cyberbully is spreading rumors in my neighborhood": "This is defamation and harassment. Save proof and report to police and NGOs.",
  "how to block someone on WhatsApp and Instagram without them knowing": "Block silently via app settings and change your privacy to restrict messages and calls.",
  "someone sent me friend request with fake pics and weird slang": "Ignore, block, and report suspicious accounts immediately.",
  "i’m scared someone will find out i reported harassment": "Reports can be confidential or anonymous. Your safety is priority and protected by law.",
  "how to protect my younger siblings from online risks": "Educate them, use parental controls, and monitor app usage without invading privacy too much.",
  "my phone got infected with malware after clicking a link": "Run antivirus scan, don’t click unknown links, change passwords, and get tech help if needed.",
  "what if police are corrupt and don’t take my complaint seriously": "Contact NGOs like DRF or AGHS Legal Aid who can escalate or provide alternative support.",
  "how to identify phishing messages in Urdu or Roman Urdu": "Look for poor grammar, urgent demands, or suspicious links—never share passwords or OTPs.",
  "my harasser threatens to spread false info about me on WhatsApp groups": "Save screenshots and file a complaint under PECA for defamation and harassment.",
  "someone used deepfake tech to create fake videos of me": "Report immediately to FIA and NGOs; this is a serious offense under cyber laws.",
  "how to report cybercrime anonymously": "Use NGO hotlines like DRF 0800-39393 or file anonymous complaints via FIA online portals.",
  "my parents are strict and I can’t talk to them about cyber harassment": "Seek confidential support from NGOs or trusted adults outside family.",
  "what if my harasser is family or relative": "This is difficult but you still have legal protection. NGOs can guide you safely through next steps.",
  "someone shared my private chats in group chats": "Privacy violation is illegal. Save proof and report to platforms and authorities.",
  "how to stay safe while chatting on dating apps": "Verify profiles, avoid sharing personal info early, and meet in public if you meet offline.",
  "how to get legal help without paying lawyer fees": "Contact free legal aid NGOs like DRF, AGHS Foundation, or local women’s rights groups.",
  "can cybercrime victims get compensation in Pakistan": "Sometimes, but legal processes are slow. NGOs can advise on your options.",
  "my online stalker follows me offline too": "Report to police immediately and seek restraining orders with NGO help.",
  "how to protect passwords from being hacked": "Use strong, unique passwords and password managers; change regularly and enable 2FA.",
  "what to do if harasser threatens my family": "Report threats to police immediately and get help from legal aid NGOs for protection.",
  "my harasser uses local insults mixed with English": "Don’t take insults personally. Save evidence and report. Slang doesn’t excuse abuse.",
  "how to avoid phishing scams in Pakistan": "Don’t click links from unknown senders, verify sources, and use antivirus apps.",
  "someone is blackmailing me with screenshots of chats": "Never pay or negotiate. Save evidence and report to NCCIA and NGOs immediately.",
  "i'm feeling hopeless after online harassment": "Reach out for mental health support. You’re not alone and help is available.",
  "how to delete embarrassing social media posts made by others": "Report posts for violation and request takedown through platform and legal channels.",
  "can police trace anonymous online abusers": "Yes, cyber forensics can track IPs and accounts. Report everything to authorities.",
  "my harasser is pretending to be me online": "Identity theft is illegal. Collect proof and report to platforms and NCCIA.",
  "how to explain cybercrime to conservative family in Urdu": "Use simple terms like 'digital zulm' and focus on safety. NGOs can provide Urdu counseling support.",
  "my friends mock me for reporting harassment": "True friends support you. Ignore toxic people and find online or offline support groups.",
  "someone shared my private videos on TikTok": "Report immediately to platform and file legal complaint for privacy violation.",
  "what is digital forensics and how does it help": "Experts recover deleted messages and trace cybercriminals to build strong cases.",
  "how long does cybercrime case take in Pakistan": "Usually months, sometimes years. Stay patient and keep following up through NGOs.",
  "how to protect kids online from grooming": "Educate early, monitor activity, and encourage open communication about online friends.",
  "what is sextortion and how to fight it": "Blackmail using explicit content. Never pay, save proof, and report immediately.",
  "someone is posting fake news about me": "Defamation is punishable. Save evidence and report to platforms and police.",
  "how to get restraining orders for online harassment": "File complaint with police and seek court orders with legal aid support.",
  "my harasser is a stranger using fake identity": "Block, save proof, and report to NCCIA. Authorities can investigate fake accounts.",
  "how to stay safe on social media during festivals or family events": "Limit posts, adjust privacy, and avoid oversharing personal info or location.",
  "my cyberbully is spreading rumors at school": "Report to school authorities, save evidence, and involve parents or NGOs for help.",
  "what apps offer anonymous counseling in Pakistan": "Rozan, Umang, and other NGOs provide online support and helplines confidentially.",
  "i'm embarrassed but want to get help": "Shame is common but you deserve justice and support. Reach out anonymously if needed.",
  "how to talk to friends about cyber abuse": "Be honest if you feel safe. Real friends will listen and support you.",
  "what to do if i receive threatening calls": "Save caller ID if possible, block number, and report to FIA immediately.",
  "how to get privacy settings right on WhatsApp and Instagram": "Set profiles to private, limit who can see your stories and contact you.",
  "my cybercrime case was dismissed unfairly": "Appeal through NGOs and legal aid groups who can help you reopen or escalate the case.",
  "parents are blackmailing me with my private data": "some family members might threaten to expose your private chats or pics to control or shame you. this is abuse. save proof and contact drf helpline 0800-39393 for confidential help.",
  "family forcing me to give social media passwords": "you have the right to privacy. forcing you to share passwords is controlling behavior. seek advice from ngos like drf or aghs for protection and legal options.",
  "blackmail by distant relatives or neighbors": "people in your community might try to exploit family honor fears by threatening to leak your private info. save all threats, block them, and report to nccia or drf asap.",
  "school ignoring my online bullying reports": "if school authorities dismiss your cyberbullying complaints, document everything and report to nccia or legal aid ngos. your safety is their responsibility too.",
  "fake marriage proposals leading to harassment": "scammers or creeps pretending to propose can later blackmail or stalk. never share sensitive info, save evidence, and report under peca section 21.",
  "deepfake videos from old school photos": "perpetrators sometimes use your school pics to create fake videos for blackmail. this is illegal under peca. report immediately to fia and drf.",
  "threats of honor violence after online abuse": "if someone threatens family honor violence for reporting, your safety is priority. contact ngos for protection plans and legal support.",
  "harassment on dating apps like tinder or muzmatch": "harassers can stalk or blackmail after online dating. use app privacy settings, block, and report any threats to platform and authorities.",
  "fake viral rumors on whatsapp groups": "false info spread in family or community whatsapp groups is defamation and harassment. save screenshots and report to nccia or police.",
  "online groomers pretending to be cousins or friends": "groomers gain trust pretending to be family or friends to exploit you. block, report, and never share private info.",
  "police bribery or apathy in cybercrime cases": "if local police ignore or take bribes, contact ngos like drf or aghs for escalation and legal aid.",
  "harassment via tiktok or instagram live": "live public shaming or harassment is a criminal offense. report platform abuse and file legal complaints immediately.",
  "blackmail with doctored screenshots or videos": "fake or edited content used to blackmail is still illegal. save originals and report to cyber authorities.",
  "threats to leak family member info for pressure": "harassers may threaten your relatives to coerce silence. this is criminal. report and seek protection.",
  "friends sharing private content without consent": "even friends sharing your pics or chats without permission is harassment and privacy violation. report and block them.",
  "fake profile using my pics and slang": "identity theft using your photos and style is punishable under peca. collect proof and report immediately.",
  "ex threatening to leak old whatsapp chats": "save screenshots, block him, and report for blackmail and harassment under peca section 21.",
  "feeling depressed and alone after online abuse": "reach out to mental health ngos like rozan or mind matters pakistan. you’re not alone, and help is real.",
  "family blames me for cyber harassment": "victim blaming is wrong and harmful. get support from legal aid ngos and trusted counselors.",
  "explaining cyber harassment to conservative family": "use simple terms like 'digital zulm' focusing on safety and privacy. ngos can help mediate family discussions confidentially.",
  "harasser sending local slang threats": "don’t ignore threats because of slang or informal language. save proof and report to authorities.",
  "scared to tell anyone due to judgement": "judgment hurts but your safety is priority. helplines like drf offer anonymous, non-judgmental support.",
  "called 'churail' and 'bewafa' after breakup": "online abuse and name-calling is harassment. save evidence and report for legal action.",
  "harassed by fake accounts spamming insults": "block and report every fake profile. keep proof for legal complaints.",
  "exhausted from constant threats": "practice self-care, take breaks, and get mental health support to cope with trauma.",
  "number posted on meme pages with mocking captions": "this violates privacy under peca. save screenshots and report immediately.",
  "parents forcing me to delete evidence to avoid shame": "protect yourself first. back up evidence securely and seek ngo advice on family-safe strategies.",
  "keeping digital footprint safe and minimal": "use strong passwords, enable 2fa, avoid oversharing, and regularly check privacy settings.",
  "cyberbully spreading rumors in neighborhood": "defamation and harassment. report to police, save proof, and involve ngos.",
  "blocking on whatsapp and instagram without notifying": "use app privacy settings to silently block and restrict contacts.",
  "suspicious friend requests with fake pics and slang": "ignore, block, and report suspicious accounts immediately.",
  "scared harasser will find out i reported": "complaints can be anonymous and confidential. your safety is protected.",
  "protecting younger siblings online": "educate, set parental controls, monitor safely without invading privacy.",
  "phone infected by malware after clicking link": "run antivirus, don’t click unknown links, change passwords, and get tech help.",
  "police corrupt or dismissive about complaints": "contact ngos for escalation or alternative support.",
  "identifying phishing in urdu or roman urdu": "look for bad grammar, urgent demands, suspicious links; never share passwords or otp.",
  "harasser threatens to spread false info on whatsapp groups": "save screenshots, file complaint under peca for defamation and harassment.",
  "deepfake tech used to create fake videos": "report immediately to fia and ngos; serious cybercrime under law.",
  "anonymous cybercrime reporting": "use ngo hotlines like drf 0800-39393 or file anonymous complaints online.",
  "strict parents prevent talking about harassment": "seek confidential support from ngos or trusted adults outside family.",
  "harasser is family or relative": "you still have legal protections. ngos can guide you safely through reporting and protection.",
  "private chats shared in group chats": "privacy violation illegal. save proof and report.",
  "safe chatting on dating apps": "verify profiles, avoid sharing personal info early, meet in public if offline.",
  "free legal help without lawyer fees": "contact ngos like drf or aghs legal aid for free support.",
  "cybercrime victims compensation": "possible but slow process; ngos can advise.",
  "online stalker follows offline too": "report police immediately and seek restraining orders.",
  "protect passwords from hacking": "use strong, unique passwords and password managers; enable 2fa.",
  "harasser threatens family": "report threats immediately and get legal protection.",
  "harasser mixes local insults with english": "save evidence and report; language doesn’t excuse abuse.",
  "avoid phishing scams in pakistan": "don’t click unknown links, verify sources, use antivirus.",
  "blackmail with chat screenshots": "never pay; save proof and report immediately.",
  "feeling hopeless after harassment": "reach out for mental health support; you’re not alone.",
  "delete embarrassing posts by others": "report for takedown via platforms and legal means.",
  "police can trace anonymous abusers": "cyber forensics track ip and accounts; report everything.",
  "harasser pretending to be me online": "identity theft punishable; collect proof and report.",
  "explaining cybercrime in urdu to conservative family": "use terms like 'digital zulm'; ngos offer urdu counseling.",
  "friends mock reporting harassment": "true friends support; ignore toxic people and find safe groups.",
  "private videos shared on tiktok": "report platform and file legal complaint.",
  "digital forensics help": "experts recover messages and trace criminals for cases.",
  "case length in pakistan": "months to years; stay patient and follow up.",
  "protect kids from grooming online": "educate early, monitor, encourage open talk.",
  "fight sextortion": "never pay, save evidence, report immediately.",
  "fake news posted about me": "defamation punishable; save proof and report.",
  "restraining orders for online harassment": "file complaint and seek court orders with legal aid.",
  "harasser is stranger with fake identity": "block, save proof, report to nccia.",
  "stay safe on social media during events": "limit posts, adjust privacy, avoid oversharing.",
  "cyberbully spreading rumors at school": "report authorities, save evidence, involve ngos.",
  "anonymous counseling apps in pakistan": "use rozan, umang, and other ngos for confidential support.",
  "embarrassed but want help": "shame is normal; you deserve support and justice.",
  "talking to friends about abuse": "be honest if safe; real friends listen and support.",
  "threatening calls": "save caller id, block, report to fia.",
  "set privacy on whatsapp and instagram": "private profiles, limit story viewers, restrict contacts.",
  "case dismissed unfairly": "appeal with ngo legal aid help.",
  "zainab ansari case": "digital forensics caught a serial predator; shows cybercrime is taken seriously in pakistan.",
  "dua zahra case": "tragic honor-based violence case reminding the need for online and offline safety.",
  "shahbaz cyber harassment conviction 2019": "convicted for online stalking and blackmail under peca, proving law enforcement is active.",
  "fake profile arrests lahore 2021": "multiple arrests for impersonation and defamation under peca with victim compensation.",
  "drf annual reports": "show rising complaints of cyber harassment against women with increasing legal actions.",
  "ayesha khan privacy case": "woman sued ex-boyfriend for sharing private photos, setting privacy violation precedent.",
  "cases like zainab ansari show cyber and physical crimes can be caught with digital evidence.": "Zainab Ansari’s case showed how digital forensics can trace both online and real-world abuse.",
  "shahbaz conviction proves offenders face consequences under peca.": "In 2019, Shahbaz was convicted under PECA for online stalking—showing cybercrimes are prosecutable.",
  "dua zahra case highlights importance of digital safety and family support.": "This tragic case underlined the need for online safety education and strong family communication.",
  "drf reports confirm increasing cyber harassment; help is available.": "Digital Rights Foundation reports show rising cases—but also more victims getting legal help.",
  "sharing private photos without consent can lead to legal action like in ayesha khan’s case.": "Ayesha Khan’s lawsuit against her ex set a legal precedent for privacy violations in Pakistan."
}


