{
  "peca kya hai": "PECA-2016 Pakistan ka cybercrime law hai. Is mein digital blackmail (Section 21), privacy tor phor (Section 20), child pornography (Section 22), grooming (Section 22A), cyberstalking (Section 24), identity theft, hacking waghera shamil hain. Sazayein jurm ki type ke mutabiq hoti hain.",
  "peca meaning": "PECA ka matlab hai Prevention of Electronic Crimes Act-2016, jo online harasment, fake accounts, defamation aur hacking jaise masail ka hal hai.",
  "pika law": "PECA Pakistan ka cybercrime law hai. Is mein digital blackmail, privacy misuse, identity theft shamil hain—aur jurm ke liye 5 million rupay tak jurmana aur jail ho sakti hai.",
  "pakistan cyber law": "Pakistan mein cybercrime PECA-2016 ke zariye control hota hai. Shikayat NCCIA (pehle FIA Cyber Wing) handle karta hai jo Section 51 ke tahat bana tha.",
  "phishing": "Phishing aik cyber hamla hai jahan attacker kisi trusted shakhs ka bhes bana ke aapki sensitive maloomat chura leta hai.",
  "2fa": "2FA yani Two-Factor Authentication aapki security ko strong banata hai — sirf password se zyada.",
  "malware": "Malware wo software hota hai jo aapke system ko nuksan pohanchane ke liye design kiya gaya hota hai.",
  "vpn": "VPN aapke data ko encrypt karta hai aur location ko chhupa deta hai. Is se aapko tracking se bachao milta hai.",
  "encryption": "Encryption ka matlab hai data ko unreadable code mein badalna — jaise messaging apps mein hota hai.",
  "firewall": "Firewall aik digital deewar hoti hai jo khatarnak traffic ko aapke system mein aane se rokta hai.", 
  "how to report cybercrime": "Cybercrime report karne ke liye FIA ya NCCIA ki helpline 1991 par call karein, ya cybercrime@fia.gov.pk par email karein. Complaint ke sath digital saboot zaroor bhejein jaise screenshots, URLs, dates, aur CNIC.",
  "report to fia": "FIA ko report karne ke liye 1991 par call karein ya email karein saboot ke sath (jaise screenshots, URLs) aur apna ID document bhi bhejein.",
  "fia complaint": "Saboot jama karein jaise screenshots, chat logs, aur URLs. Phir FIA ya NCCIA ki website par jakar complaint file karein.",
  "file cyber crime report": "Aap 1991 par call karke ya email cybercrime@fia.gov.pk par apni complaint file kar sakte hain. Aapko ek tracking number milega jo save karke rakhein.",
  "i am being blackmailed": "Agar koi aapko dhamka raha hai ke tasveerein ya chats leak karega agar aap ne paisay nahi diye, to yeh PECA Section 21 ke tehat illegal hai. Saboot bachayein, kabhi paisay na dein, aur foran report karein.",
  "online blackmail": "Online blackmail — jisme photos ya chats leak karne ki dhamki hoti hai — PECA Section 21 ke tehat jurm hai. Saboot ke sath foran report karein.",
  "blackmail law pakistan": "Digital blackmail Pakistan mein PECA Section 21 ke zariye jurm hai. Saza 7 saal tak ki jail aur 5 million rupay tak ka jurmana ho sakta hai.",
  "online harassment": "Agar koi baar baar dhamki de ya unwanted messages bheje ya aapki personal cheezein share kare, to yeh harassment hai PECA Section 24/24A ke mutabiq. Complaint file karein.",
  "harassment complaint": "Harassment ki complaint ke liye 1991 par call karein ya email bhejein. Chat logs, screenshots, aur URLs ka record zaroor rakhein.",
  "privacy violation": "Agar koi aapki private messages, photos, ya data bina ijazat ke share kare to yeh PECA Section 20 ke tehat privacy violation hai. Saboot ke sath report karein.",
  "leaked photo": "Agar aapki personal photo kisi ne bina permission ke share ki hai to yeh PECA Section 21 ke under jurm hai. Timestamps aur source ka saboot bachayein.",
  "someone shared my chats": "Aapke private messages agar kisi ne public kiye to yeh PECA Section 20 ke mutabiq illegal hai. Screenshots lein aur NCCIA ko report karein.",
  "identity theft": "Kisi aur ka naam ya tasveer online istemal karna PECA Section 20 aur PPC Section 378 ke tehat identity theft hai. Saboot ke sath report karein.",
  "fake profile": "Agar koi fake profile banaye jo aapke naam ya photo ka istemal kare to yeh PECA Section 20 ke under identity theft hai. NCCIA ko saboot ke sath report karein.",
  "impersonation online": "Online impersonation yani doosre ka bhes bana kar kisi ko dhoka dena jurm hai. Saboot save karein aur FIA/NCCIA ko report karein.",
  "deepfake": "Agar koi aapki deepfake video ya image banaye aur share kare bina permission ke to yeh PECA Section 20/21 ke tehat illegal hai.",
  "revenge porn": "Revenge porn PECA Section 21 ke tehat serious jurm hai. Saza 7 saal tak ki ho sakti hai. NCCIA ya DRF se foran madad lein.",
  "sextortion": "Agar koi aapko dhamka raha hai ke aapki nude ya private tasveerein leak karega jab tak aap uski demand poori na karein to yeh sextortion hai. Foran PECA Section 21 ke under report karein.",
  "i am being groomed online": "Agar koi bara shakhs aap se dosti karke aapko misuse karne ki koshish kare to yeh grooming hai aur PECA Section 22A ke tehat jurm hai. Block karein aur report karein.",
  "what is grooming": "Grooming ka matlab hota hai bharose ka faida utha kar kisi ko sexually exploit karna. PECA Section 22A ke mutabiq yeh 5-10 saal ki saza wala jurm hai.",
  "underage nudes law": "18 saal se chhote kisi bhi shakhs ka sexual content banana ya share karna child pornography ke under aata hai. PECA Section 22 ke mutabiq yeh crime hai.",
  "is sexting legal in pakistan": "Sexting sirf adults ke darmiyan legal hai. Agar koi ek bhi minor ho to yeh PECA Section 22 ke mutabiq illegal hai, chahe dono ki raza ho.",
  "i'm 18 and she's 17 can we sext": "Nahi. Pakistan mein 18 se chhota shakhs minor kehlata hai. Uske sath koi bhi explicit content share karna illegal hai, chahe dono ki raza ho.",
  "he said it was a joke": "Agar koi minor se sexual content mangta hai chahe 'mazak' mein bhi, to yeh PECA Section 22A ke under jurm hai. Report karein.",
  "fake account using my name": "Agar koi aapke naam aur photo ka fake account banaye to yeh identity theft hai. Screenshots lein aur NCCIA ko report karein.",
  "someone posted my number on a meme page": "Agar kisi ne aapka phone number meme ya public page par share kiya to yeh privacy violation hai. PECA Section 20 ke tehat report karein.",
  "they leaked my number on insta": "Agar aapka number public post mein dala gaya hai to yeh illegal hai. Screenshots lein aur NCCIA ko report karein.",
  "i cannot afford a lawyer": "Agar aap lawyer afford nahi kar sakte to DRF, AGHS aur kuch NGOs cybercrime victims ko free legal support dete hain.",
  "i'm ashamed": "Sharmindagi mehsoos karna normal hai — lekin yeh jurm aapka nahi. DRF (0800‑39393) se raabta karein, aap anonymous bhi rah sakte hain.",
  "i can't tell parents": "Agar aap walidain ko nahi bata sakte to DRF helpline (0800‑39393) par raabta karein — woh anonymous support dete hain.",
  "my parents strict": "Agar aapke walidain strict hain to bhi aap DRF (0800‑39393) se confidential madad le sakte hain ya anonymously NCCIA ko report kar sakte hain.",
  "zainab case reference": "2018 mein Zainab Ansari case mein FIA ne digital forensics ka use karke mujrimon ko pakra — yeh cybercrime ki importance ko dikhata hai.",
  "child porn law pakistan": "PECA Section 22 ke tehat, kisi bhi minor (18 se chhota) ka nude content banana ya rakhna jurm hai. Saza 14–20 saal jail aur 1 million tak jurmana ho sakta hai.",
  "nccia powers": "NCCIA (3 May 2024 ko establish hui) ke paas digital forensics, content block karne, saboot ikatha karne aur arrest karne ka ikhtiyar hai.",
  "court privacy": "Jahan minor ya sexual crimes involve hon, unka trial PECA Section 30C ke mutabiq 'in-camera' hota hai — yani public se door victim ki privacy bachane ke liye.",
  "reddit advice": "Reddit par log aksar yeh mashwara detay hain: saboot save karein, publicly na post karein, aur NCCIA se contact karein. Aap akelay nahi hain.",
  "my parents found out": "Agar ghar walon ko pata chal gaya hai to ghabrayen nahi. DRF jaise NGOs aapko samjhaane aur handle karne mein madad karte hain.",
  "i'm scared to tell parents": "Dar lagna normal hai. Aap still DRF ya NCCIA se anonymously madad le sakte hain bina walidain ko involve kiye.",
  "my parents are strict and controlling": "Agar aapko backlash ka dar hai to apni safety ko priority dein. DRF ki helpline (0800-39393) confidential support deti hai.",
  "embarrassed about sharing": "Sharminda mehsoos karna aam baat hai — lekin yeh jurm aapka nahi. Trusted NGOs se madad lein.",
  "friend shared my secret online": "Agar kisi friend ne aapka secret bina poochay public kiya to yeh illegal hai. Screenshots lein aur report karein.",
  "someone is threatening me online": "Agar koi dhamkian de raha hai to yeh crime hai. Saboot bachayein, screenshots lein, aur NCCIA ko report karein.",
  "my ex is stalking me online": "Agar aapka ex aapka peecha karta hai online to yeh PECA ke tehat stalking hai. Block karein aur authorities ko saboot ke sath report karein.",
  "i received fake calls and messages": "Fake calls aur messages ka record rakhein. FIA ko report karein taake investigation ho sake.",
  "my account got hacked": "Passwords foran change karein, 2FA enable karein, aur hacking ki report FIA ko dein.",
  "i was scammed online": "Scammer se rabta foran band karein, chat ka record save karein, aur NCCIA ko fraud report karein.",
  "someone posted my photos without consent": "Agar koi aapki photos bina permission ke post kare to yeh illegal hai. Report karein aur removal ki request karein.",
    "where to report cybercrime": "Aap NCCIA ko report kar sakte hain helpline 1991 par call karke ya email cybercrime@fia.gov.pk par bhej kar.",
  "how to send evidence": "Screenshots, voice notes, links, dates — sab digital saboot aik file mein bhejein. File ka naam sahi tarah se likhein, jaise 'chat_screenshot_01'.",
  "should i delete the messages": "Nahi, messages delete na karein. Yeh saboot hain. Har cheez ka screenshot aur backup rakhna zaroori hai.",
  "can nccia trace": "Haan, NCCIA ke paas IP tracing, phone metadata analysis aur digital forensics tools hote hain jo logon ko trace karne mein madad karte hain.",
  "how long does nccia take": "Har case alag hota hai. Kuch cases mein 7 din ke andar update milta hai, lekin sensitive cases zyada time le sakte hain.",
  "does nccia arrest people": "Haan, agar saboot strong hon to NCCIA legal process follow karke accused ko arrest kar sakta hai.",
  "will my identity be revealed": "Agar aap chahain to aapki shanakht confidential rakhi jati hai — khaaskar agar aap minor hain ya sensitive case ho.",
  "can i file anonymously": "Haan, aap apna real naam disclose kiye bagair bhi complaint file kar sakte hain — DRF ya trusted NGOs aapki madad karte hain.",
  "i'm under 18 can i report": "Bilkul. PECA minors ko special protection deta hai. Aap DRF (0800‑39393) ko call karke confidential madad le sakte hain.",
  "is nccia safe": "Haan, NCCIA cybercrime handle karne wali authorized agency hai. Lekin agar aap uncomfortable mehsoos karein to NGOs jaise DRF madad karte hain.",
  "who sees my report": "Aapki report sirf assigned officer aur investigation team dekhti hai. Confidentiality maintain ki jati hai.",
  "will parents be informed": "Agar aap minor hain to kuch cases mein walidain ko bataya ja sakta hai — lekin DRF aapko samjha kar help karta hai.",
  "how to contact drf": "DRF ki helpline 0800-39393 hai. Aap anonymously call kar sakte hain aur Urdu/English mein baat kar sakte hain.",
  "can i go to police": "Cybercrime pehle FIA/NCCIA handle karta hai. Magar agar jaan ka khatra ho ya immediate help chahiye ho to police ko bhi involve kiya ja sakta hai.",
  "can i delete my photo": "Agar photo public forum par hai to aap takedown request de sakte hain. Har platform ka apna report button hota hai.",
  "how to file takedown": "Har platform — jaise Facebook, Instagram, TikTok — ka report/takedown option hota hai. Aap 'privacy violation' ya 'nudity' choose kar sakte hain.",
  "what if platform doesn't respond": "Agar platform response nahi deta to FIA ko contact karein ya DRF se legal takedown ka process samjhein.",
  "do i need a lawyer": "Agar case court tak jaye to lawyer zaroori hota hai — DRF aur AGHS jaise NGOs free legal aid dete hain.",
  "how do i know my case is accepted": "Jab aapki complaint file hoti hai to aapko ek ticket number milta hai. Us se aap apne case ka status track kar sakte hain.",
  "what if i get no response": "Agar 10 din tak koi response na aaye to follow-up karein ya DRF se madad lein. Complaint ka copy zaroor save karein.",
  "can i stop midway": "Aap kabhi bhi apna case withdraw kar sakte hain, lekin agar dusre log bhi affected hoon to investigation phir bhi chal sakti hai.",
  "will it go public": "Nahi. PECA Section 30C ke mutabiq aise cases private hote hain, khaaskar jab minor involved ho.",
  "can i talk to a woman officer": "Agar aap chahain to FIA/DRF se female case officer ya counselor ki request kar sakte hain.",
  "how to protect my account": "Strong password, 2FA enable karein, unknown links par click na karein, aur regular login activity check karein.",
  "how to protect from scam": "Unknown numbers, links aur offers se door rahain. Kisi ko apni OTP ya CNIC details mat dein.",
  "how to enable 2fa": "Facebook, Instagram, Gmail waghera mein settings > security > Two-Factor Authentication (2FA) mein jaake enable karein.",
  "how to check who is using my photo": "Google reverse image search ya tineye.com par apni photo upload karke dekhein kahan kahan use ho rahi hai.",
  "how to take screenshot": "Mobile: Volume Down + Power ya 3-finger swipe. PC: PrtScn button ya Snipping Tool ka use karein.",
  "can a photo be traced": "Haan, agar original file ho to metadata aur upload history se trace kiya ja sakta hai. NCCIA forensic tools use karta hai.",
  "can a fake account be traced": "Haan, fake account banane wale ka IP, device ID aur login history se trace kiya ja sakta hai — lekin time lagta hai.",
  "how to report meme pages": "Post ke neeche 3 dots > Report par click karein. Privacy violation, nudity ya harassment select karein.",
  "what is nccia": "NCCIA yani National Cyber Crime Investigation Agency, jo FIA ki nayi wing hai aur PECA Section 51 ke under kaam karti hai.",
  "what is peca section 20": "PECA Section 20 privacy violation, impersonation aur fake content ko illegal banata hai.",
  "what is peca section 21": "Section 21 non-consensual image sharing ya blackmailing ko jurm banata hai. Saza: 7 saal jail tak.",
  "what is peca section 22": "Section 22 child pornography se related hai. Is mein 14–20 saal tak ki jail ho sakti hai.",
  "what is peca section 24": "Section 24 online harassment aur stalking ko punish karta hai.",
  "what is section 22a": "Section 22A grooming aur minors se sexual contact ke attempt ko jurm banata hai.",
  "what is section 30c": "Section 30C kehta hai ke sexual aur minor cases ka trial 'in-camera' hoga — yani public access nahi hogi.",
  "what is section 51": "Section 51 ke tehat NCCIA ko establish kiya gaya — yeh national-level cyber investigation authority hai.",
  "can i report from abroad": "Haan, agar victim Pakistan mein hai ya attacker Pakistani hai to aap overseas hone ke bawajood report kar sakte hain.",
  "what is drf": "DRF yani Digital Rights Foundation — aik NGO hai jo online safety, legal help aur mental health support provide karta hai.",
  "can DRF help me report": "Haan, DRF aapki report likhne, submit karne aur follow-up mein madad karta hai — aap anonymous bhi reh sakte hain.",
  "i don't have CNIC": "Agar aap ke paas CNIC nahi hai to DRF aapko guide karega ke kaise identity verify karni hai report ke liye.",
  "what if saboot nahi hai": "Agar saboot nahi hain to report mushkil hoti hai. Isliye har cheez ka screenshot lena aur backup rakhna zaroori hai.",
  "what is evidence": "Evidence mein screenshots, chat logs, call recordings, links aur timestamps shamil hote hain. Sab ko zip karke bhejna best hota hai.",
  "can screenshots be faked": "Haan, isliye timestamps aur context kaafi zaroori hote hain. NCCIA original data trace karke verify karta hai.",
  "what if they deny": "Agar attacker sab kuch deny kare to digital forensics ke zariye NCCIA asal IP, metadata aur account links nikal sakta hai.",
  "how to secure phone": "Unknown apps uninstall karein, screen lock lagayein, Google Play Protect on karein, aur photos auto-backup disable karein.",
  "how to secure phone": "Unknown apps uninstall karein, screen lock lagayein, Google Play Protect on karein, aur photos auto-backup disable karein.",
  "how to deal with blackmail": "Blackmailer ko kabhi paisay na dein. Screenshots aur chats ka backup lein, unko block karein, aur NCCIA ko report karein.",
  "what if i get threats": "Har threat ka screenshot lein, date/time likhein, aur FIA ko report karein. Zarurat par DRF ya police se madad lein.",
  "how to block someone": "Har app mein 'Block' option hota hai — settings ya profile par jaake use block karein. Is se woh aapko message nahi kar sakta.",
  "can i stop fake messages": "Fake messages ke numbers ko block karein, spam report karein, aur unknown links par click na karein.",
  "how to backup chats": "WhatsApp: Settings > Chats > Chat Backup. Messenger/Instagram: Settings > Your Info > Download Your Data.",
  "what is metadata": "Metadata woh hidden info hoti hai jo image/file ke andar hoti hai — jaise time, date, location, device info.",
  "can deleted messages be recovered": "Haan, kuch apps mein backup se recover ho sakti hain. Lekin forensics tools deleted chats bhi nikal sakte hain.",
  "should i confront the attacker": "Nahi, attacker se confront karna khatarnaak ho sakta hai. Saboot ikattha karein aur report karein.",
  "should i post my story online": "Agar aap comfortable hain to awareness ke liye post kar sakte hain — lekin privacy aur legal advice lena zaroori hai.",
  "can i sue someone": "Haan, agar aapke paas saboot ho to aap defamation ya harassment ke liye civil suit file kar sakte hain.",
  "how to sue for defamation": "Aap civil court mein defamation case file kar sakte hain agar koi aapki reputation nuqsan pohcha raha ho.",
  "can i report on behalf of friend": "Haan, aap friend ya family ke liye bhi complaint file kar sakte hain agar unki marzi ho aur saboot ho.",
  "what is digital consent": "Digital consent ka matlab hai kisi bhi photo, message, ya info ko share karne se pehle ijazat lena.",
  "consent in relationships": "Rishton mein bhi har digital cheez — photo, video, message — share karne se pehle consent lena zaroori hai.",
  "what is cyberstalking": "Bar bar messages bhejna, online follow karna, tracking apps use karna — yeh sab cyberstalking kehlata hai.",
  "cyberstalking law": "PECA Section 24 ke mutabiq cyberstalking jurm hai. Saza 3 saal tak ki ho sakti hai.",
  "he uses tracking apps": "Agar koi aapka phone ya location track kar raha hai bina ijazat ke to yeh illegal hai. App uninstall karein aur report karein.",
  "he threatens to kill himself": "Agar koi aapko emotional pressure daal raha hai to yeh manipulation hai. DRF ya trusted adult se baat karein.",
  "i'm scared to leave": "Agar aapko emotional ya digital abuse ho raha hai to DRF ya support line se madad lein. Aap akelay nahi hain.",
  "online emotional abuse": "Online dhamkiyan, guilt trips, ya mental stress dena — yeh sab emotional abuse hai. Isay serious lein.",
  "i want to stay anonymous": "Aap complaint anonymous bhi file kar sakte hain — NGOs jaise DRF confidential support dete hain.",
  "will police help": "Cybercrime ka pehla step FIA/NCCIA hota hai, lekin agar physical danger ho to police ko foran involve karein.",
  "how long case takes": "Har case ka duration alag hota hai. Kuch 7 din mein resolve ho jate hain, kuch ko months lagte hain.",
  "how to protect images": "Cloud backup disable karein, gallery ko lock karein, aur personal photos share karne se pehle trust zaroor evaluate karein.",
  "is recording someone illegal": "Bina ijazat ke kisi ki photo ya video lena PECA Section 21 ke mutabiq illegal hai.",
  "he screen recorded our video call": "Bina ijazat screen record karna aur use kisi aur ko dikhana privacy violation hai. Report karein.",
  "she shared my screenshot": "Agar koi private chat ka screenshot bina pooche share kare to yeh PECA Section 20 ke tehat jurm hai.",
  "he leaked our chats": "Bina ijazat private chats leak karna privacy violation hai. NCCIA ko saboot ke sath report karein.",
  "she shared my audio message": "Agar koi aapki voice note ya audio clip share kare bina ijazat ke to yeh illegal hai. Saboot lein aur report karein.",
  "will court believe me": "Agar aapke paas screenshots, timestamps, aur context ho to court mein aapka case strong hota hai.",
  "what is court process": "Pehle inquiry hoti hai, phir FIR file hoti hai, phir court hearing hoti hai. NGOs legal help mein madad karte hain.",
  "who will see my chats": "Sirf investigating officer aur court ko zarurat par access diya jata hai — public nahi dekhti.",
  "can i use voice as proof": "Haan, audio recording agar asli ho to digital evidence ke tor par use hoti hai — lekin tampering nahi honi chahiye.",
  "can minors file complaint": "Haan, PECA minors ko protect karta hai. DRF aur FIA aise cases ko sensitivity ke sath handle karte hain.",
  "can parents stop my case": "Nahi, agar aap legal age mein hain to aap apni marzi se case file aur pursue kar sakte hain.",
  "can i get damages": "Agar aapka case court jeet jaye to aapko emotional distress aur defamation ke damages mil sakte hain.",
  "can i withdraw case": "Haan, aap apni marzi se case withdraw kar sakte hain — lekin agar public interest ho to state continue kar sakti hai.",
  "do i need to go to court": "Har case mein zaroori nahi. Agar FIA ya platform level par solve ho jaye to court ki zaroorat nahi padti.",
  "does peca cover emails": "Haan, emails bhi PECA ke under aati hain — fake emails, threats, ya scams sab cover hote hain.",
  "how to identify scam email": "Spelling mistakes, unknown links, urgent tone — yeh scam email ki nishaniyan hain.",
  "i clicked scam link": "WiFi band karein, antivirus run karein, passwords change karein, aur agar kuch leak hua to FIA ko report karein.",
  "someone is using my pic": "Google reverse image search karein. Agar misuse ho raha hai to uss platform aur FIA dono ko report karein.",
  "i found my pic on fake account": "Fake account ka screenshot lein, report karein aur platform takedown request dein. NCCIA ko bhi inform karein.",
  "they made a page with my name": "Yeh impersonation hai. PECA Section 20 ke under illegal hai. NCCIA ko saboot ke sath report karein.",
  "he used my photo in comment": "Bina permission aapka photo kisi bhi post ya comment mein use karna privacy violation hai. Screenshot lein aur report karein.",
  "how to stop sharing": "WhatsApp, Instagram, Telegram mein Forwarding Disable settings use karein. Watermark ya blur bhi help karta hai.", 
  "how to blur a photo": "Photo editing apps jese Snapseed ya Gallery tools se photo blur kar sakte hain. Sensitive parts blur karein share karne se pehle.",
  "should i watermark": "Haan, watermark se aapke photo ka misuse rok sakte hain. Apps jese Add Watermark use karein.",
  "what is a takedown request": "Jab aap platform se kehte hain ke koi illegal ya harmful content hata diya jaye, use takedown request kehte hain.",
  "how to file takedown": "Har platform ka 'Report' ya 'Help' section hota hai jahan aap form bhar ke content report kar sakte hain.",
  "facebook report": "Post ya profile ke 3 dots par click karein, 'Find Support or Report' choose karein, aur reason select karein.",
  "instagram report": "Post ya profile ke upar 3 dots tap karein, 'Report' select karein, aur suitable reason choose karein.",
  "youtube report": "Video ke neeche 3 dots > Report > 'Infringes my rights' ya 'Harassment' select karein, aur form bhar dein.",
  "tiktok report": "Video ke upar 3 dots > Report > Harassment ya Privacy choose karein. Screenshot bhi upload kar sakte hain.",
  "twitter report": "Tweet ke 3 dots > Report Tweet > Privacy Violation ya Hateful Conduct select karein.",
  "how long for removal": "Har platform ka apna review time hota hai — kuch 24 hours mein content hata dete hain, kuch ko 3–5 din lagte hain.",
  "what if platform does nothing": "Agar platform action nahi le raha to aap FIA ko directly takedown request ke sath report karein.",
  "can i contact platform support": "Haan, aap Help Center ya support@platform.com par apna case aur saboot ke sath email bhej sakte hain.",
  "how to draft email to support": "Subject mein likhein: 'Urgent: Privacy Violation'. Email mein incident explain karein aur screenshots attach karein.",
  "i'm being cyberbullied": "Agar log aapko comment ya message mein tease ya insult kar rahe hain to yeh cyberbullying hai. Saboot lein aur report karein.",
  "cyberbullying law": "PECA Section 24 ke tehat online bullying, trolling aur humiliation illegal hai.",
  "i'm being trolled": "Trolling ya mass abuse ko serious lein — saboot jama karein aur platform par report karein. Zarurat par NCCIA ko bhi bhejein.",
  "how to stay safe online": "Strong passwords use karein, 2FA enable karein, unknown links se bachein, aur privacy settings tight karein.",
  "what is 2FA": "2FA (Two-Factor Authentication) ek extra security layer hai — password ke baad aapko OTP ya app code dena padta hai.",
  "should i disable location": "Haan, location sharing sirf trusted apps ya logon ke liye on rakhein. Settings mein location access control karein.",
  "how to protect kids": "Kids ke devices par parental controls lagayein, unse khul kar baat karein, aur apps ka usage monitor karein.",
  "safe apps for kids": "YouTube Kids, Khan Academy, Duolingo jese apps zyada safe hote hain — lekin monitoring zaroori hai.",
  "how to talk to kids": "Seedhi aur asaan zubaan mein samjhayen ke online kis cheez se door rehna chahiye — bina dant ke baat karein.",
  "internet rules for kids": "Time limit set karein, safe search on karein, aur unknown messages open na karne ki aadat dalwayein.",
  "can i report for my child": "Haan, agar aap parent ya guardian hain to aap NCCIA ko apne bache ke behalf par report kar sakte hain.",
  "how to track online activity": "Apps jese Google Family Link, Bark, ya built-in screen time monitor se aap activity track kar sakte hain.",
  "signs of online abuse": "Bachay ka mood badal jaye, chup ho jaye, ya device chupke use kare to yeh signs ho sakte hain. Khuli baat karein.",
  "safe schools online": "School ko bhi guide karein ke wo awareness aur cyber safety training ko curriculum ka hissa banayein.",
  "cybercrime for girls": "Girls zyadah blackmail, sextortion aur fake profiles ka nishana banti hain. Awareness aur support zaroori hai.",
  "support for girls": "DRF, Hamara Internet, aur NCCIA girls ko safe report aur legal aid dete hain. Confidential support milta hai.",
  "how to protect accounts": "Har account ka alag password rakhein, 2FA on karein, aur email notifications check karte rahen.",
  "can i file FIR online": "FIA complaint portal par aap online FIR initiate kar sakte hain. Visit: www.fia.gov.pk/cyber-crime",
  "tracking number use": "Complaint submit karne ke baad jo tracking ID milti hai, usay future reference ke liye note karein.",
  "can i update my complaint": "Haan, aap apni purani complaint par naya saboot attach karke update kar sakte hain — same tracking ID use karein.",
  "how to follow up": "FIA helpline 1991 par call karein ya apni tracking ID ke sath inquiry bhejein via email.",
  "is my phone tapped": "Agar aapko noise, echo, ya battery drain ho raha ho — to suspicious ho sakta hai. Forensic scan se check karwaein.",
  "can social media be traced": "Haan, IP logs, device ID, aur phone metadata ke zariye social media activities trace ki ja sakti hain.",
  "i am scared of reporting": "Ye normal hai — lekin aap akelay nahi hain. Confidential NGOs ya DRF se pehle baat karein.",
  "what if family finds out": "DRF aur FIA aapki identity confidential rakhte hain. Aap anonymously bhi case pursue kar sakte hain.",
  "can i get mental help": "Haan, DRF aur Taskeen jese NGOs cyber trauma ke liye counseling aur mental health support dete hain.",
  "can i get legal help": "Haan, legal clinics aur DRF aapko advocate provide karte hain jo court process samjhate hain.",
  "what is peeca": "PECA 2016 Pakistan ka cybercrime law hai — harassment, blackmail, identity theft waghera ko punish karta hai.",
  "does peeca protect minors": "Haan, PECA mein minors ke liye special clauses hain jo unki identity aur data ko protect karte hain.",
  "digital violence kya hoti hai": "Online harassment, leaks, doxxing, trolling — yeh sab digital violence ke under aata hai.",
  "what is doxxing": "Kisi ka personal info jaise address, number, ya school online leak karna bina ijazat ke doxxing kehlata hai.",
  "does peeca cover doxxing": "Haan, PECA Section 20 aur 21 ke tehat personal data leak karna illegal hai.", 
  "can i report harassment at work": "Haan, agar aapko office ya workplace mein digital ya verbal harassment ka samna hai to aap FIA ke sath sath internal HR ya harassment committee ko bhi report kar sakte hain.",
  "he sent threats on email": "Email ke through dhamki dena cybercrime hai. Email ka header aur content dono ka screenshot lein aur FIA ko report karein.",
  "how to save email proof": "Email ka full header aur body content download karein ya screenshot lein. Gmail mein 'Show Original' ka option use karein.",
  "can i report fake job post": "Haan, agar koi fake job ya internship online post kar raha hai aur logon ka data le raha hai to aap FIA ko report kar sakte hain.",
  "how to spot fake job ad": "Agar job ad mein spelling errors hoon, official email na ho, ya salary unusually high ho — to yeh fake ho sakti hai.",
  "someone asked nude photo": "Yeh sextortion ka case ho sakta hai. Kabhi kisi ko aise photos na bhejein. Agar bheji hain to screenshots lein aur FIA ko report karein.",
  "sextortion law in pakistan": "PECA Section 21 ke tehat kisi ko photos ke zariye dhamkana ya exploit karna illegal hai.",
  "what if my pics leaked": "Panic na karein. Screenshot lein, takedown request file karein, aur FIA ko report karein. DRF se support bhi lein.",
  "how to talk to friend in trouble": "Usay blame na karein. Sunne ki koshish karein, support dekhayein, aur confidential help offer karein.",
  "signs someone is being abused": "Wo zyada chup ho jaye, anxiety dikhaye, ya phone chhupaye — to abuse ka signal ho sakta hai.",
  "how to help without pressure": "Usay space aur trust dein. Kehna ke 'Main tumhare sath hoon' kaafi hota hai shuru mein.",
  "where to learn about cyber safety": "DRF, Hamara Internet, aur FIA ke platforms par awareness aur free resources available hain.",
  "are boys also harassed": "Haan, harassment sirf ladkiyon ka masla nahi. Boys bhi online blackmail, stalking aur trolling ka shikar ho sakte hain.",
  "is flirting harassment": "Agar doosra banda uncomfortable mehsoos kare ya baar baar mana kare to flirting bhi harassment ban sakta hai.",
  "can teacher be reported": "Haan, agar teacher online ya offline abuse kare to school ki harassment committee aur FIA dono ko report kiya ja sakta hai.",
  "can police access my chats": "Police sirf legal warrant ya complaint ke zariye chats access kar sakti hai. Aapka consent ya court approval chahiye hota hai.",
  "how to know if phone is hacked": "Achanak battery drain, data usage increase, apps auto install — yeh phone hack hone ke signs ho sakte hain.",
  "should i reset my phone": "Agar phone suspicious behave kar raha ho to factory reset karna safe option hai. Pehle important data backup lein.",
  "what is stalkerware": "Stalkerware woh spy apps hoti hain jo kisi ka phone secretly monitor karti hain — bina user ko pata chale.",
  "how to check stalkerware": "Settings > Apps > Unknown apps check karein. Suspicious names ya permissions wale apps uninstall karein.",
  "what is spyware": "Spyware ek malware hota hai jo aapki activity, passwords ya messages secretly send karta hai kisi aur ko.",
  "how to remove spyware": "Trusted antivirus app se full scan karein. Agar kuch detect ho to usay turant delete karein aur passwords change karein.",
  "can spyware be in links": "Haan, suspicious links ke through spyware install ho sakta hai. Kabhi unknown link par click na karein.",
  "he uses my account": "Aapka password turant change karein. Agar account shared tha, to 2FA on karein aur recent activity review karein.",
  "my ex has my photos": "Agar aapke ex ke paas aapki private photos hain aur wo misuse karne ki dhamki deta hai to yeh illegal hai. Report karein.",
  "he made fake account with my name": "Fake profile banana aur kisi aur ka naam/photo use karna impersonation hai. Screenshot lein aur FIA ko report karein.",
  "i am scared of going to court": "Aap DRF ya legal NGO ke through court process ko samajh sakte hain. Confidential help milti hai.",
  "court asked for evidence": "Evidence mein screenshots, emails, call logs ya device forensic report bhi use hoti hai. Saboot ikattha karein.",
  "he deleted our chat": "Agar chat delete ho gayi ho to backup ya witness ke through context provide karein. Screenshots save karna aadat banayein.",
  "can police access deleted data": "Forensic tools ke zariye kuch deleted data recover ho sakta hai — lekin har case mein ye possible nahi hota.",
  "he changed his number": "Agar koi apna number badal kar harassment continue kare to naye number ke saboot bhi jama karein aur case update karein.",
  "can i track fake number": "FIA aur PTA ke paas tools hote hain jinke zariye SIM registration aur IP logs trace kiye ja sakte hain.",
  "what is mobile forensics": "Mobile forensic mein experts aapke device ka data recover karte hain — including deleted messages, images, aur app logs.",
  "can i access forensic lab": "Agar FIA investigation approve kare to woh aapke case ke liye forensic analysis karte hain — direct access nahi hoti.",
  "how long does forensic take": "Device aur case complexity ke mutabiq, forensic process 7 din se lekar 30 din tak lag sakta hai.",
  "what is electronic evidence": "Screenshots, videos, call records, emails — yeh sab electronic ya digital evidence kehlate hain.",
  "what makes strong evidence": "Time stamp, context, original source aur metadata hone par digital evidence strong mana jata hai.",
  "can i get screenshot verified": "Haan, FIA aur certified labs screenshot ki authenticity verify kar sakte hain — use court mein admissible banaya jata hai.",
  "how to show chats in court": "Chats ka screenshot, backup, ya export file present karein. Court ko context clear dikhana zaroori hota hai.",
  "can i ask judge for privacy": "Haan, aap judge se request kar sakte hain ke aapka case private ya in-camera suna jaye agar sensitive ho.",
  "how many cyber courts in pakistan": "Har major city mein FIA ke saath connected cyber crime reporting aur legal hearing units hoti hain. Lahore, Karachi, Islamabad mein zyadah active hain.",
  "what if my FIR rejected": "Agar aapki FIR reject ho jaye to aap DRF, legal aid ya high-level FIA office se dobara appeal kar sakte hain.", 
  "how to redact photo": "Sensitive info jaise face, ID number ya address ko blur ya black box se cover karein photo editing tools ke zariye.",
  "can i sue for cybercrime": "Haan, agar aapka case strong ho aur saboot complete ho to aap civil ya criminal lawsuit file kar sakte hain.",
  "what is digital consent": "Jab koi apne data, image ya identity ke use par clearly 'haan' kahe — usay digital consent kehte hain.",
  "can memes be illegal": "Agar meme kisi ki photo bina ijazat ke use karta hai ya kisi ko insult karta hai, to woh illegal ho sakta hai.",
  "can jokes be cyberbullying": "Agar jokes repeatedly hoon, personal hoon, aur doosre ko harm ya embarrassment ho to woh cyberbullying ban jata hai.",
  "how to educate youth": "Workshops, storytelling, aur roleplay exercises se youth ko cyber safety aur empathy sikhaya ja sakta hai.",
  "can friends be abusers": "Haan, kai cases mein online harassment ya misuse friends ya classmates se hi hota hai. Trust but verify.",
  "how to respond to victim": "Unhe blame na karein. Kehna ke 'Main tumhari madad karna chahta hoon' support dikhata hai.",
  "does religion mention tech abuse": "Islam mein kisi ki izzat, tasveer ya personal info ka misuse gunah hai. Quran aur Hadith mein izzat ki hifazat ka zikr hai.",
  "how to balance tech and values": "Tech use karte waqt apne values ya ethics na bhoolen — har click aur share ka asar hota hai.",
  "can parents access child chats": "Agar bacha minor hai to parental guidance zaroori hai, lekin trust aur boundaries maintain karna bhi important hai.",
  "is online shaming allowed": "Nahi, kisi ko publicly shame karna — chahe galti ki ho — illegal aur morally wrong ho sakta hai.",
  "what is victim blaming": "Jab hum victim se kehte hain ke 'tumhari galti thi', 'tumne kyun bheja' — to woh blaming hota hai. Support dijiye, blame nahi.",
  "difference between flirting and harassment": "Consent aur comfort line define karti hai. Agar banda ya bandi mana kare, aur baat jari rakhi jaye — to woh flirting nahi, harassment hai.",
  "i want to volunteer": "DRF, Taskeen, Hamara Internet jaise platforms volunteers lete hain — aap awareness aur digital safety mein help kar sakte hain.",
  "what is a safe digital space": "Jahan log bina dar ke express kar sakein, privacy maintain ho, aur respectful behavior ho — use safe digital space kehte hain.",
  "can i use ai safely": "Haan, AI tools jaise chatbots ya image generators use karein lekin privacy terms aur misuse risks samajh kar.",
  "how to check ai image": "Fake ya AI-generated image ko reverse image search, shadows, ya fingers ki distortion se pehchana ja sakta hai.",
  "does ai spread misinformation": "Haan, agar AI wrong input pe train ho to galat info ya fake news spread kar sakta hai — verify karna zaroori hai.",
  "how to report ai misuse": "Agar koi AI tool aapki image ya data ka misuse karta hai, us platform ko report karein ya DRF se madad lein.",
  "can i report fake ai voice": "Haan, agar aapki voice deepfake ya clone karke misuse hui hai, to PECA aur FIA dono ke tahat report file ho sakti hai.",
  "is cybercrime increasing": "Jee haan, online users barhne se cybercrime bhi barh raha hai — awareness aur reporting zyada zaroori ho gayi hai.",
  "how to stop blackmail": "Evidence ikattha karein, FIA ko report karein, aur kisi trusted friend ya NGO se emotional support lein. Kabhi bhi dhamki se ghabrayen nahi.",
  "what is digital safety card": "Ek small guide hota hai jisme hotlines, steps to report, aur basic rights likhe hote hain — har kisi ke paas hona chahiye.",
  "can men ask for help": "Bilkul. Har gender ko cyber harassment se protection milti hai. Help lena weakness nahi — himmat ki nishani hai.",
  "he is threatening me": "Yeh serious hai. Chat ka screenshot lein, number note karein, aur FIA ko turant report karein. Support bhi lein.",
  "what is revenge porn": "Jab koi ex ya known person aapki private photos ya videos bina ijazat ke leak kare — yeh revenge porn hai, aur illegal hai.",
  "is online abuse a crime": "Haan, PECA ke mutabiq online harassment, blackmail, identity theft aur leaks sab crimes hain.",
  "i want to help a friend": "Usay sunen, support dein, aur reporting ya legal steps mein saath dein. Kabhi kabhi sirf 'Main hoon' kehna bhi kaafi hota hai.",
  "can my school help": "School ki harassment committee, trusted teacher ya counselor ko batayein — wo FIA se contact karne mein bhi madad karte hain.",
  "i clicked a bad link": "Turant password change karein, device scan karein aur suspicious activity monitor karein. DRF ya FIA se madad bhi lein.",
  "is there a cyber helpline": "Jee haan. FIA Cyber Crime Wing (1991), DRF Helpline (0800-39393), ya email se madad mil sakti hai.",
  "how to get justice": "Report karna pehla qadam hai. Saboot ikattha karein, legal aid lein, aur himmat na haarein. Aap akelay nahi hain.",
  "am i too late to report": "Kabhi bhi late nahi hota. Aap abhi bhi report kar sakte hain — jitna jaldi saboot ikattha karein, utna behtar."
}
