{
  "پی ای سی اے کیا ہے": "PECA‑2016 (الیکٹرانک جرائم کی روک تھام کا قانون) پاکستان کا مرکزی سائبر کرائم قانون ہے۔ اس میں ڈیجیٹل بلیک میل، پرائیویسی کی خلاف ورزی، چائلڈ پورنوگرافی، گروومنگ، سائبر اسٹاکنگ، شناخت کی چوری، نقلی شناخت، ہیکنگ، اسپیمنگ وغیرہ شامل ہیں۔ سزائیں جرمانوں سے لے کر کئی سال قید تک ہو سکتی ہیں۔",
  "پی ای سی اے کا مطلب": "PECA کا مطلب ہے Prevention of Electronic Crimes Act‑2016، جو آن لائن ہراسانی، جعلی اکاؤنٹس، بہتان اور ہیکنگ جیسے خطرات سے نمٹنے کے لیے بنایا گیا تھا۔",
  "پیکا قانون": "PECA پاکستان کا سائبر کرائم قانون ہے۔ یہ ڈیجیٹل بلیک میل، پرائیویسی کے غلط استعمال، شناخت کی چوری جیسے جرائم کو کور کرتا ہے۔ سزا میں 50 لاکھ روپے تک جرمانہ اور قید شامل ہے۔",
  "پاکستان کا سائبر قانون": "پاکستان میں سائبر کرائم PECA‑2016 کے تحت کنٹرول کیا جاتا ہے۔ شکایات NCCIA (سابقہ FIA سائبر ونگ) کے ذریعے نمٹائی جاتی ہیں، جو PECA کے سیکشن 51 کے تحت قائم ہوا۔",
  "فشنگ": "فشنگ ایک قسم کا سائبر حملہ ہے جس میں حملہ آور جعلی شناخت اختیار کر کے حساس معلومات چرانے کی کوشش کرتے ہیں۔",
  "ٹو فیکٹر اتھینٹیکیشن": "ٹو فیکٹر اتھینٹیکیشن (2FA) ایک اضافی حفاظتی پرت مہیا کرتی ہے جو صرف یوزرنیم اور پاسورڈ سے بڑھ کر ہوتی ہے۔",
  "میل ویئر": "میل ویئر ایسا سافٹ ویئر ہے جو کمپیوٹر سسٹمز کو نقصان پہنچانے یا ان کا غلط استعمال کرنے کے لیے بنایا جاتا ہے۔",
  "وی پی این": "VPN آپ کی آن لائن ٹریفک کو انکرپٹ کرتا ہے اور آپ کا مقام چھپاتا ہے، جس سے ٹریکنگ سے بچاؤ ہوتا ہے۔",
  "انکرپشن": "انکرپشن آپ کے ڈیٹا کو ناقابلِ فہم کوڈ میں بدل دیتی ہے۔ چیٹ ایپس میں یہ آپ کی گفتگو کو محفوظ رکھنے کے لیے استعمال ہوتی ہے۔",
  "فائر وال": "فائر وال نقصان دہ ٹریفک کو آپ کے سسٹم میں داخل ہونے سے روکتا ہے۔ یہ سائبر سیکیورٹی کے لیے ضروری ہے۔",
  "سائبر کرائم کی رپورٹ کیسے کریں؟": "سائبر کرائم کی شکایت کرنے کے لیے NCCIA/FIA ہیلپ لائن 1991 پر کال کریں (یا NCCIA کے لیے 051‑9106691)، یا cybercrime@fia.gov.pk پر ای میل کریں، قریبی CCRC آفس جائیں، یا FIA کا آن لائن پورٹل استعمال کریں۔ ہمیشہ اسکرین شاٹس، لنکس، تاریخیں، اور اپنا CNIC شامل کریں۔",
  "FIA کو رپورٹ کیسے کریں؟": "رپورٹ کے لیے 1991 پر کال کریں یا NCCIA کو ثبوت (اسکرین شاٹس، لنکس) اور شناختی دستاویزات کے ساتھ ای میل کریں تاکہ تحقیقات شروع ہو سکے۔",
  "FIA شکایت": "اسکرین شاٹس، چیٹ لاگز، اور یو آر ایل جیسے ثبوت اکٹھے کریں۔ پھر 1991 پر کال کریں یا NCCIA/FIA کی ویب سائٹ پر شکایت درج کریں۔",
  "سائبر کرائم رپورٹ درج کرنا": "آپ 1991 ہیلپ لائن پر کال کر کے یا cybercrime@fia.gov.pk پر ای میل کے ذریعے رپورٹ درج کر سکتے ہیں۔ جمع کروانے کے بعد ایک ٹریکنگ نمبر ملتا ہے، اسے محفوظ رکھیں۔",
  "مجھے بلیک میل کیا جا رہا ہے": "اگر کوئی آن لائن بلیک میل کر رہا ہے (مثلاً تصاویر یا چیٹس لیک کرنے کی دھمکی دے رہا ہے)، یہ PECA سیکشن 21 کے تحت جرم ہے۔ پیغامات محفوظ کریں، کبھی پیسے نہ دیں، اور فوراً NCCIA کو رپورٹ کریں۔",
  "آن لائن بلیک میل": "تصاویر یا چیٹس لیک کرنے کی دھمکی دینا آن لائن بلیک میل ہے، جو PECA سیکشن 21 کے تحت غیر قانونی ہے۔ فوراً NCCIA کو ثبوت کے ساتھ رپورٹ کریں۔",
  "پاکستان میں بلیک میلنگ قانون": "ڈیجیٹل بلیک میل ایک سنگین جرم ہے—PECA سیکشن 21 کے تحت 7 سال قید اور 50 لاکھ روپے جرمانے کی سزا ہو سکتی ہے۔",
  "آن لائن ہراسانی": "مسلسل دھمکیاں، ناپسندیدہ پیغامات یا نجی مواد کو پھیلانا PECA سیکشن 24/24A کے تحت ہراسانی ہے—NCCIA کو شکایت درج کریں۔",
  "ہراسانی کی شکایت": "ہراسانی کی شکایت درج کرنے کے لیے NCCIA سے 1991 پر کال کریں یا ای میل بھیجیں۔ چیٹ ریکارڈ اور لنکس بطور ثبوت محفوظ رکھیں۔",
  "پرائیویسی کی خلاف ورزی": "بغیر اجازت نجی پیغامات، تصاویر یا ڈیٹا شیئر کرنا PECA سیکشن 20 کے تحت جرم ہے—اسکرین شاٹس جیسے ثبوت کے ساتھ شکایت درج کریں۔",
  "لیک ہوئی تصویر": "اگر آپ کی نجی تصویر بغیر اجازت شیئر کی گئی ہے، تو یہ PECA سیکشن 21 کے تحت خلاف ورزی ہے—NCCIA کو رپورٹ کریں، وقت اور ماخذ سمیت ثبوت محفوظ رکھیں۔",
  "کسی نے میری چیٹس شیئر کیں": "نجی پیغامات کو پبلش کرنا PECA سیکشن 20 کے تحت غیر قانونی ہے۔ اسکرین شاٹس جمع کریں اور NCCIA کو شکایت کریں۔",
  "شناخت کی چوری": "کسی اور کا نام یا تصویر آن لائن استعمال کرنا PECA سیکشن 20 اور PPC سیکشن 378 کے تحت شناخت کی چوری ہے۔ ثبوت کے ساتھ رپورٹ کریں۔",
  "جعلی پروفائل": "جعلی پروفائل بنانا PECA سیکشن 20 کے تحت شناخت کی چوری ہے۔ اسکرین شاٹس لیں، NCCIA کو رپورٹ کریں، اور اکاؤنٹ ہٹانے کی درخواست دیں۔",
  "آن لائن نقلی شناخت": "آن لائن نقلی شناخت اختیار کرنا جرم ہے۔ ثبوت محفوظ کریں اور NCCIA/FIA کو رپورٹ کریں تاکہ اکاؤنٹ ختم ہو سکے۔",
  "ڈیپ فیک": "کسی کی اجازت کے بغیر ڈیپ فیک ویڈیوز یا تصاویر بنانا یا شیئر کرنا PECA سیکشن 20/21 کے تحت غیر قانونی ہے—رپورٹ کریں۔",
  "ریونج پورن": "ریونج پورن ایک سنگین جرم ہے، PECA سیکشن 21 کے تحت قابل سزا ہے۔ 7 سال قید کی سزا ہو سکتی ہے۔ NCCIA یا DRF سے مدد لیں۔",
  "سیکساٹورشن": "اگر کوئی شخص نازیبا مواد لیک کرنے کی دھمکی دے کر مطالبات منواتا ہے، تو یہ سیکساٹورشن ہے—PECA سیکشن 21 کے تحت فوری رپورٹ درج کریں۔", 
  "میں آن لائن گروومنگ کا شکار ہو رہا ہوں": "آن لائن گروومنگ — جب کوئی بالغ نابالغ سے دوستی کر کے اسے استحصال کے لیے استعمال کرے — PECA سیکشن 22A کے تحت غیر قانونی ہے۔ فوراً بلاک کریں اور رپورٹ کریں۔",
  "گروومنگ کیا ہے؟": "گروومنگ اعتماد قائم کر کے جنسی استحصال کی نیت سے کی جاتی ہے۔ PECA سیکشن 22A کے تحت یہ جرم ہے، جس کی سزا 5 سے 10 سال قید ہے۔",
  "کم عمر افراد کی نازیبا تصاویر کا قانون": "18 سال سے کم عمر افراد کی کسی بھی نازیبا مواد پر مبنی تصویر یا ویڈیو بنانا یا شیئر کرنا PECA سیکشن 22 کے تحت چائلڈ پورنوگرافی ہے۔",
  "پاکستان میں سیکسٹنگ قانونی ہے؟": "سیکسٹنگ صرف اس صورت میں قانونی ہو سکتی ہے جب دونوں افراد کی عمر 18 سال سے زیادہ ہو۔ بصورت دیگر یہ PECA سیکشن 22 کے تحت جرم ہے۔",
  "میں 18 اور وہ 17 سال کی ہے، کیا ہم سیکسٹ کر سکتے ہیں؟": "نہیں۔ پاکستان میں 18 سال سے کم عمر کو نابالغ تصور کیا جاتا ہے، اور اس سے نازیبا مواد کا تبادلہ غیر قانونی ہے، چاہے باہمی رضامندی ہو۔",
  "اس نے کہا یہ صرف مذاق تھا": "نابالغ سے نازیبا مواد مانگنے والا مذاق بھی PECA سیکشن 22A کے تحت جرم ہے۔ ایسے واقعات کی رپورٹ کریں۔",
  "میرے نام سے جعلی اکاؤنٹ بنایا گیا": "کسی کے نام یا تصویر سے جعلی اکاؤنٹ بنانا PECA سیکشن 20 کے تحت شناخت کی چوری ہے۔ ثبوت جمع کریں اور رپورٹ کریں۔",
  "کسی نے میرا نمبر میم پیج پر شیئر کیا": "بغیر اجازت ذاتی معلومات جیسے فون نمبر شیئر کرنا PECA سیکشن 20 کے تحت پرائیویسی کی خلاف ورزی ہے۔ فوراً NCCIA کو رپورٹ کریں۔",
  "انہوں نے انسٹاگرام پر میرا نمبر لیک کیا": "آپ کا نمبر پبلک کرنا جرم ہے۔ اسکرین شاٹس لیں اور PECA سیکشن 20 کے تحت رپورٹ کریں۔",
  "میں وکیل افورڈ نہیں کر سکتا": "آپ کو پرائیویٹ وکیل کی ضرورت نہیں—DRF، AGHS لیگل ایڈ اور دیگر NGOs مفت قانونی مدد فراہم کرتے ہیں۔",
  "مجھے شرم آ رہی ہے": "شرمندگی محسوس کرنا فطری ہے، لیکن یہ جرم آپ کا قصور نہیں ہے۔ DRF (0800‑39393) سے خفیہ مدد حاصل کریں، آپ گمنام شکایت بھی درج کر سکتے ہیں۔",
  "میں والدین کو نہیں بتا سکتا": "اگر آپ والدین کو نہیں بتا سکتے، تو DRF ہیلپ لائن (0800‑39393) پر خفیہ رہنمائی حاصل کریں۔",
  "میرے والدین سخت مزاج ہیں": "اگر والدین سخت ہیں اور آپ ڈرتے ہیں، تو بھی DRF (0800‑39393) سے خفیہ مدد لی جا سکتی ہے یا NCCIA کو گمنام شکایت بھیجی جا سکتی ہے۔",
  "زینب کیس کا حوالہ": "2018 کے زینب انصاری کیس میں FIA/NCCIA نے ڈیجیٹل فارنزکس کے ذریعے مجرم کو گرفتار کیا—یہ ظاہر کرتا ہے کہ سائبر جرائم کو سنجیدگی سے لیا جاتا ہے۔",
  "پاکستان میں چائلڈ پورنوگرافی کا قانون": "PECA سیکشن 22 کے تحت، 18 سال سے کم عمر بچوں کی نازیبا ویڈیوز یا تصاویر رکھنا یا شیئر کرنا جرم ہے۔ سزا 14 سے 20 سال قید اور 10 لاکھ روپے جرمانہ ہو سکتی ہے۔",
  "NCCIA کے اختیارات": "NCCIA، جو 3 مئی 2024 کو PECA سیکشن 51 کے تحت قائم ہوا، کے پاس تفتیش، ڈیجیٹل ثبوت اکٹھا کرنے، مواد بلاک کرنے اور گرفتاری کے اختیارات ہیں۔",
  "عدالتی رازداری": "نابالغ یا جنسی نوعیت کے مقدمات کی سماعت PECA سیکشن 30C کے تحت بند کمرے میں کی جاتی ہے تاکہ متاثرہ کی شناخت محفوظ رہے۔",
  "ریڈٹ پر مشورہ": "ریڈٹ صارفین اکثر مشورہ دیتے ہیں کہ ثبوت محفوظ کریں، پبلک پوسٹنگ سے گریز کریں، اور NCCIA سے رابطہ کریں۔",
  "میرے والدین کو پتہ چل گیا": "اگر آپ کے گھر والوں کو پتہ چل جائے، تو گھبرائیں نہیں۔ DRF جیسے ادارے آپ کی مدد کر سکتے ہیں کہ گھر کے حالات خراب کیے بغیر آپ اپنا دفاع کر سکیں۔",
  "میں والدین کو بتانے سے ڈرتا ہوں": "ڈرتے ہوئے مدد لینا بالکل ٹھیک ہے۔ DRF یا NCCIA سے گمنام طور پر مدد لیں، خاندان کو شامل کیے بغیر۔",
  "میرے والدین سخت اور کنٹرولنگ ہیں": "اگر آپ کو ردعمل کا خوف ہے تو اپنی حفاظت کو ترجیح دیں۔ DRF ہیلپ لائن (0800‑39393) پر خفیہ مدد حاصل کریں۔",
  "شیئر کرنے پر شرمندگی ہو رہی ہے": "آپ اکیلے نہیں ہیں، بہت سے لوگ شرمندگی محسوس کرتے ہیں۔ یاد رکھیں، یہ جرم آپ کا نہیں ہے۔ اعتماد والے اداروں سے مدد حاصل کریں۔",
  "دوست نے میرا راز آن لائن شیئر کر دیا": "بغیر اجازت نجی معلومات شیئر کرنا غیر قانونی ہے۔ ثبوت جمع کریں اور فوراً رپورٹ کریں۔",
  "مجھے آن لائن دھمکیاں دی جا رہی ہیں": "دھمکیاں دینا جرم ہے۔ تمام پیغامات محفوظ کریں، اسکرین شاٹس لیں، اور NCCIA کو رپورٹ کریں۔",
  "میرا سابقہ ​​مجھے آن لائن اسٹاک کر رہا ہے": "سائبر اسٹاکنگ PECA کے تحت قابل سزا جرم ہے۔ اس شخص کو بلاک کریں اور ثبوت کے ساتھ رپورٹ کریں۔",
  "مجھے جعلی کالز اور میسجز موصول ہو رہے ہیں": "کالز اور میسجز کا ریکارڈ رکھیں۔ FIA کو رپورٹ کریں تاکہ تحقیقات کی جا سکے۔",
  "میرا اکاؤنٹ ہیک ہو گیا ہے": "فوراً پاسورڈز تبدیل کریں، 2FA آن کریں، اور FIA کو ہیکنگ کی رپورٹ دیں۔",
  "مجھے آن لائن دھوکہ دیا گیا": "دھوکہ دہی کرنے والوں سے رابطہ ختم کریں، چیٹ لاگز محفوظ کریں، اور NCCIA کو دھوکہ دہی کی رپورٹ دیں۔",
  "کسی نے میری تصاویر بغیر اجازت پوسٹ کیں": "بغیر اجازت نجی تصاویر پوسٹ کرنا غیر قانونی ہے۔ فوراً رپورٹ کریں اور ہٹانے کی درخواست دیں۔",
  "آن لائن بُلیئنگ نے مجھے تباہ کر دیا": "سائبر بُلیئنگ قابل سزا جرم ہے۔ ثبوت محفوظ کریں، بدمعاشوں کو بلاک کریں، اور شکایت درج کریں۔",
  "میں اپنی شناخت خفیہ رکھنا چاہتا ہوں": "آپ NGOs یا FIA ہیلپ لائنز کے ذریعے گمنام رپورٹ درج کر سکتے ہیں۔ آپ کی حفاظت اولین ترجیح ہے۔",
  "تحقیقات میں کتنا وقت لگتا ہے؟": "یہ کیس پر منحصر ہوتا ہے، لیکن مضبوط ثبوت ہونے سے عمل تیز ہو جاتا ہے۔",
  "کیا مجھے مفت قانونی مدد مل سکتی ہے؟": "جی ہاں، DRF اور AGHS جیسے ادارے متاثرین کو مفت قانونی امداد فراہم کرتے ہیں۔",
  "اگر ملزم کو پتہ چل گیا تو؟": "رپورٹنگ گمنام اور خفیہ ہو سکتی ہے۔ قانون کے تحت آپ کی شناخت اور حفاظت کو تحفظ حاصل ہے۔", 
  "میں خود کو آن لائن کیسے محفوظ رکھوں؟": "مضبوط پاسورڈ استعمال کریں، ذاتی معلومات کم شیئر کریں، 2FA آن کریں، اور اجنبیوں سے محتاط رہیں۔",
  "آن لائن گروومنگ کیا ہے؟": "جب بالغ افراد نابالغوں سے آن لائن دوستی کر کے ان کا جنسی یا جذباتی استحصال کرتے ہیں، یہ گروومنگ کہلاتا ہے اور غیر قانونی ہے۔",
  "سیکساٹورشن کیا ہے؟": "نازیبا تصاویر یا ویڈیوز کے ذریعے بلیک میل کرنا سیکساٹورشن کہلاتا ہے—کبھی ادائیگی نہ کریں اور فوراً رپورٹ کریں۔",
  "کیا نابالغ سائبر کرائم رپورٹ کر سکتے ہیں؟": "جی ہاں، کوئی بھی شکایت درج کرا سکتا ہے، اور نابالغوں کے لیے خصوصی مدد دستیاب ہے۔",
  "میں افسردہ اور تنہا محسوس کر رہا ہوں": "کونسلرز یا NGOs سے مدد لیں۔ آپ اکیلے نہیں ہیں، اور مدد موجود ہے۔",
  "مجھے بدلہ لینے کا ڈر ہے": "آپ کی حفاظت اولین ترجیح ہے؛ خفیہ مدد لیں اور خود سے ملزم کا سامنا نہ کریں۔",
  "ثبوت کیسے اکٹھے کریں؟": "اسکرین شاٹس لیں، URL اور تاریخ نوٹ کریں، چیٹ لاگز محفوظ رکھیں۔",
  "اپنا ڈیجیٹل فٹ پرنٹ کیسے کم کریں؟": "ذاتی معلومات کم شیئر کریں، پرائیویسی سیٹنگز ایڈجسٹ کریں، اور پلیٹ فارمز سے مواد ہٹانے کی درخواست دیں۔",
  "جعلی پروفائل کیا ہوتا ہے؟": "ایسا اکاؤنٹ جو آپ یا کسی اور کی نقل کرتا ہے، عام طور پر ہراسانی یا دھوکہ دہی کے لیے استعمال ہوتا ہے۔",
  "جعلی پروفائل کی رپورٹ کیسے کریں؟": "پلیٹ فارم پر رپورٹ کریں اور ثبوت کے ساتھ NCCIA کو بھی شکایت کریں۔",
  "آن لائن ٹرولز سے کیسے نمٹیں؟": "انہیں بلاک کریں، رپورٹ کریں، اور ردعمل سے گریز کریں۔ اگر خطرہ ہو تو ثبوت ضرور محفوظ کریں۔",
  "کیا میں سائبر ہراسانی پر کیس کر سکتا ہوں؟": "جی ہاں، PECA کے تحت آپ شکایت اور قانونی کارروائی کر سکتے ہیں۔",
  "میرا فون ہیک ہو گیا ہے": "فوراً انٹرنیٹ بند کریں، اینٹی وائرس چلائیں، اور ماہرین سے مدد لیں۔",
  "کسی نے میرا نمبر شیئر کر دیا ہے": "ذاتی رابطے کی معلومات بغیر اجازت شیئر کرنا جرم ہے، ثبوت کے ساتھ رپورٹ کریں۔",
  "ڈیجیٹل بلیک میل کیا ہے؟": "ذاتی معلومات یا تصاویر کے ذریعے پیسے یا فائدہ حاصل کرنے کی دھمکی دینا۔",
  "اپنی پرائیویسی کیسے محفوظ رکھیں؟": "انکرپشن، VPN، مضبوط پاسورڈز استعمال کریں اور معلومات سوچ سمجھ کر شیئر کریں۔",
  "آن لائن بدنامی سے کیسے نمٹیں؟": "جھوٹے الزامات کے ثبوت محفوظ کریں اور اتھارٹیز کو شکایت کریں۔",
  "آن لائن دھمکی ملنے پر کیا کریں؟": "تمام ثبوت محفوظ کریں، بھیجنے والے کو بلاک کریں، اور فوراً رپورٹ کریں۔",
  "آن لائن دھوکہ دہی سے کیسے نمٹیں؟": "اجنبیوں کو ذاتی معلومات نہ دیں اور مشکوک سرگرمی کی رپورٹ کریں۔",
  "سوشل میڈیا پر محفوظ کیسے رہیں؟": "پرائیویسی سیٹنگز استعمال کریں، اجنبیوں کی فرینڈ ریکویسٹ قبول نہ کریں، اور معلومات کم شیئر کریں۔",
  "فشنگ اٹیک کیا ہے؟": "جعلی ای میلز یا میسجز جو آپ کی معلومات چرانے کے لیے ہوتے ہیں۔",
  "فشنگ سے کیسے بچیں؟": "مشکوک لنکس پر کلک نہ کریں، بھیجنے والے کو چیک کریں، اور اینٹی وائرس استعمال کریں۔",
  "میل ویئر کیا ہے؟": "ایسا سافٹ ویئر جو آپ کے سسٹم کو نقصان پہنچاتا ہے یا اس کا غلط استعمال کرتا ہے۔",
  "میل ویئر سے کیسے بچیں؟": "نامعلوم ذرائع سے کچھ ڈاؤنلوڈ نہ کریں، اور سافٹ ویئر کو اپڈیٹ رکھیں۔",
  "کیا بغیر وکیل قانونی مدد مل سکتی ہے؟": "جی ہاں، NGOs مفت قانونی مشورہ اور مدد فراہم کرتے ہیں۔",
  "چائلڈ پورن کی رپورٹ کیسے کریں؟": "فوراً FIA اور NCCIA کو ثبوت کے ساتھ رپورٹ کریں۔",
  "اگر سائبر پولیس مدد نہ کرے تو؟": "NGOs سے رابطہ کریں یا FIA کے اعلیٰ افسران کو شکایت بھیجیں۔",
  "ثبوت کیسے محفوظ رکھیں؟": "اسکرین شاٹس اور فائلز کو محفوظ جگہ رکھیں، اور بیک اپ بنائیں۔",
  "رپورٹ کے بعد ثبوت ڈیلیٹ کر سکتا ہوں؟": "نہیں، جب تک کیس مکمل نہ ہو، تمام ثبوت محفوظ رکھیں۔",
  "سائبر اسٹاکنگ کیا ہے؟": "بار بار آن لائن ہراسانی یا نگرانی کرنا، جو ذہنی اذیت کا باعث بنتی ہے۔",
  "سائبر اسٹاکنگ کیسے ثابت کریں؟": "تمام پیغامات، اسکرین شاٹس، تاریخیں اور لنکس محفوظ کریں۔",
  "آن لائن اسٹاکرز کو کیسے بلاک کریں؟": "پلیٹ فارمز کے بلاک اور رپورٹ ٹولز استعمال کریں۔",
  "آن لائن گروومنگ کیا ہوتی ہے؟": "بچے سے دوستی کر کے اس کا استحصال کرنا—یہ PECA کے تحت غیر قانونی ہے۔",
  "گروومنگ کی علامات کیسے پہچانیں؟": "زیادہ توجہ، راز رکھنے کی باتیں، یا نامناسب گفتگو گروومنگ کی علامات ہو سکتی ہیں۔",
  "اگر کسی نے گروومنگ کی ہو تو کیا کریں؟": "بلاک کریں، رپورٹ کریں، اور قابلِ اعتماد بڑوں یا اتھارٹی سے مدد لیں۔",
  "ریونج پورن کیا ہے؟": "ذاتی تصاویر بغیر اجازت نقصان پہنچانے کے ارادے سے شیئر کرنا۔",
  "ریونج پورن کیسے ہٹوائیں؟": "پلیٹ فارم پر رپورٹ کریں اور قانونی شکایت درج کریں۔",
  "کیا سائبر کرائم کی شکایت گمنام ہو سکتی ہے؟": "جی ہاں، کئی ہیلپ لائنز اور NGOs گمنام رپورٹنگ کی سہولت دیتی ہیں۔",
  "آن لائن ہراسانی کی گمنام شکایت کیسے کریں؟": "DRF جیسی NGO ہیلپ لائن یا FIA کے آن لائن پورٹل کے ذریعے شکایت کریں۔",
  "کیا نابالغوں کو قانونی تحفظ حاصل ہے؟": "جی ہاں، پاکستانی قوانین نابالغوں کو سائبر استحصال سے تحفظ فراہم کرتے ہیں۔",
  "کیا خاندان میری شکایت کو روک سکتا ہے؟": "نہیں، قانون متاثرہ فرد کے حقوق کا تحفظ کرتا ہے، چاہے خاندان راضی نہ ہو۔",
  "سوشل میڈیا بُلیئنگ سے کیسے نمٹیں؟": "بدمعاشوں کو بلاک کریں، ثبوت محفوظ کریں، پلیٹ فارم اور اتھارٹیز کو رپورٹ کریں۔",
  "فشنگ اسکیم کیا ہے؟": "دھوکہ دہی کے ذریعے پاسورڈ یا مالی معلومات حاصل کرنے کی کوشش۔",
  "فشنگ کی شناخت کیسے کریں؟": "ای میل کے پتے، لنکس، اور املا کی غلطیوں کو چیک کریں۔",
  "سائبر بُلیئنگ کیا ہے؟": "ڈیجیٹل میڈیا کے ذریعے بار بار کسی کو ہراساں یا ڈرانا۔",
  "سائبر بُلیئنگ کیسے ثابت کریں؟": "اسکرین شاٹس اور پیغامات یا کالز کا ریکارڈ رکھیں۔",
  "سائبر جرائم کی سزائیں": "جرم کی نوعیت پر منحصر—3 سال سے لے کر 20 سال قید اور جرمانے تک۔",
  "کیا سائبر مجرموں کو ملک سے واپس لایا جا سکتا ہے؟": "جی ہاں، پاکستان بین الاقوامی سطح پر تعاون کرتا ہے۔",
  "اگر میرا دوست متاثر ہو تو؟": "اسے رپورٹ کرنے کا مشورہ دیں اور جذباتی طور پر اس کی مدد کریں۔", 
  "بچوں کو آن لائن کیسے محفوظ رکھیں؟": "پیرنٹل کنٹرول استعمال کریں، خطرات سے آگاہ کریں، اور ان کی سرگرمیوں کی نگرانی کریں۔",
  "کیا سائبر کرائم کے ثبوت جعلی ہو سکتے ہیں؟": "ہاں، لیکن فارنزک ماہرین عدالت میں اصلیت کی تصدیق کرتے ہیں۔",
  "سائبر کرائم کیس مکمل ہونے میں کتنا وقت لگتا ہے؟": "پیچیدگی پر منحصر ہے، عام طور پر کئی ماہ یا سال لگ سکتے ہیں۔",
  "کیا سوشل میڈیا کمپنیاں مواد ہٹا سکتی ہیں؟": "جی ہاں، درخواست یا عدالتی حکم پر مواد ہٹایا جا سکتا ہے۔",
  "سائبر بدنامی (defamation) کیا ہے؟": "جھوٹی باتیں پھیلا کر کسی کی ساکھ کو نقصان پہنچانا۔",
  "سائبر بدنامی سے کیسے نمٹیں؟": "ثبوت کے ساتھ شکایت درج کریں اور مواد ہٹانے کی درخواست دیں۔",
  "پاسورڈز کو کیسے محفوظ بنائیں؟": "منفرد اور مضبوط پاسورڈز استعمال کریں، اور پاسورڈ مینیجر استعمال کریں۔",
  "ڈیجیٹل فارنزکس کیا ہے؟": "ڈیجیٹل ثبوت اکٹھا کرنا، بحال کرنا، اور تفتیش کرنا تاکہ کیس مضبوط بنایا جا سکے۔",
  "کیا میں ذاتی طور پر سائبر کرائم رپورٹ کر سکتا ہوں؟": "جی ہاں، قریبی FIA یا CCRC دفتر جا کر رپورٹ کریں۔",
  "کیا اسکرین شاٹس عدالت میں قابل قبول ہیں؟": "جی ہاں، بشرطیکہ وہ تصدیق شدہ ہوں، عدالت میں قابل قبول ہیں۔",
  "ریسٹریننگ آرڈر آن لائن کیسے حاصل کریں؟": "عدالت میں قانونی امداد کے ذریعے درخواست دیں۔",
  "کیا سائبر کرائم جلدی حل ہو سکتا ہے؟": "یہ ثبوت اور کیس کے بوجھ پر منحصر ہے۔",
  "کیا پولیس سائبر کرائم کو سمجھتی ہے؟": "FIA اور NCCIA میں خصوصی تربیت یافتہ سائبر یونٹس موجود ہیں۔",
  "اگر مجرم غیر ملکی ہو؟": "بین الاقوامی قانون نافذ کرنے والے ادارے تعاون کرتے ہیں؛ مقدمہ چلایا جا سکتا ہے۔",
  "کیا سیکسٹنگ جرم ہے؟": "اگر نابالغ شامل ہوں تو ہاں، بالغوں کے درمیان باہمی رضامندی سے نہیں۔",
  "سائبر ایکسٹورشن کیا ہے؟": "کسی معلومات یا تصاویر کے ذریعے پیسے یا فائدہ حاصل کرنے کی دھمکی دینا۔",
  "کیا بغیر شناختی کارڈ شکایت درج ہو سکتی ہے؟": "زیادہ تر صورتوں میں شناختی کارڈ ضروری ہوتا ہے، لیکن NGOs معاونت کر سکتے ہیں۔",
  "اپنے بچوں کو آن لائن کیسے محفوظ رکھیں؟": "تعلیم دیں، نگرانی کریں، اصول وضع کریں، اور محفوظ ایپس کا استعمال کروائیں۔",
  "پرانے سوشل میڈیا پوسٹس کیسے ڈیلیٹ کریں؟": "دستی طور پر ڈیلیٹ کریں یا پلیٹ فارم کو درخواست دیں۔",
  "کیا سائبر کرائم متاثرین کو معاوضہ مل سکتا ہے؟": "کبھی کبھار عدالتوں سے، لیکن یہ ایک پیچیدہ عمل ہے۔",
  "پاکستان میں سائبر کرائم ہاٹ لائن کیا ہے؟": "FIA/NCCIA ہاٹ لائن نمبر 1991 ہے۔",
  "میرے والدین نے میری آن لائن چیٹس دیکھ لیں": "پریشان نہ ہوں۔ وضاحت سے بات کریں اور DRF ہیلپ لائن (0800‑39393) سے مشورہ لیں۔",
  "میرے والدین سخت ہیں اور فون استعمال نہیں کرنے دیتے": "ایسی صورت میں DRF جیسی گمنام ہیلپ لائنز سے رابطہ کریں یا کسی بھروسہ مند رشتہ دار/استاد سے مدد لیں۔",
  "والدین کو سائبر ہراسانی بتانے میں شرمندگی ہو رہی ہے": "یہ فطری بات ہے، لیکن یاد رکھیں آپ اکیلے نہیں۔ DRF جیسے ادارے رازداری سے مدد فراہم کرتے ہیں۔",
  "سائبر ہراسانی کو قدامت پسند والدین کو کیسے سمجھائیں؟": "تحفظ اور قانونی پہلو پر زور دیں۔ NGOs اس بارے میں رہنمائی کر سکتے ہیں۔",
  "میرے والدین مجھے ہی قصوروار ٹھہرا رہے ہیں": "متاثرہ کو الزام دینا عام مگر غلط رویہ ہے۔ NGOs اور کونسلرز سے مدد لیں جو آپ کا دفاع کر سکیں۔",
  "مجھے ڈر ہے والدین مجھے سزا دیں گے": "آپ کی حفاظت سب سے اہم ہے۔ DRF یا AGHS لیگل ایڈ سے خفیہ طور پر رہنمائی لیں۔",
  "میرا خاندان مجھے ثبوت مٹانے پر مجبور کر رہا ہے": "ثبوت مٹائیں مت۔ انہیں محفوظ کریں اور کسی بھروسہ مند ادارے کو شیئر کریں۔",
  "دوست مجھے شرمندہ کر رہے ہیں": "اصل دوست ساتھ دیتے ہیں۔ اگر وہ سپورٹ نہ کریں تو خود کو ان سے دور کریں اور مدد حاصل کریں۔",
  "میرا سابقہ نجی تصاویر لیک کرنے کی دھمکی دے رہا ہے": "یہ ریونج پورن ہے اور PECA کے تحت غیر قانونی ہے۔ بلاک کریں، ثبوت محفوظ کریں، اور NCCIA/DRF کو رپورٹ کریں۔",
  "کسی کو بلاک کیسے کریں کہ اسے پتہ نہ چلے": "پلیٹ فارم سیٹنگز استعمال کر کے خاموشی سے بلاک کریں، اور پرائیویسی سیٹنگز تبدیل کریں۔",
  "میرا اکاؤنٹ ہیک ہو کر جعلی میسجز بھیجے جا رہے ہیں": "فوراً پاسورڈز تبدیل کریں، 2FA آن کریں، اور FIA کو رپورٹ کریں۔",
  "دوست نے میری شرمناک تصویر اجازت کے بغیر شیئر کی": "یہ پرائیویسی کی خلاف ورزی ہے۔ انہیں ہٹانے کو کہیں، نہ مانیں تو پلیٹ فارم اور حکام کو رپورٹ کریں۔",
  "میں اب فون استعمال کرنے سے ڈر رہا ہوں": "کچھ وقت فون سے دور رہیں، سیکیورٹی بہتر کریں، اور کونسلرز سے مدد حاصل کریں۔",
  "آن لائن دھمکیوں کے بعد کوئی آف لائن میرا پیچھا کر رہا ہے": "یہ سنگین معاملہ ہے—پولیس کو اطلاع دیں، واقعات ریکارڈ کریں، اور ریحائشی تحفظ حاصل کریں۔",
  "سوشل میڈیا پر محفوظ رہنے کے لیے کیا کریں؟": "اکاؤنٹس پرائیویٹ رکھیں، ذاتی تفصیلات کم شیئر کریں، اور مشکوک سرگرمی فوراً رپورٹ کریں۔",
  "آن لائن ہراسانی کے بعد افسردگی محسوس ہو رہی ہے": "ذہنی صحت کے ماہرین یا NGOs جیسے Rozan یا DRF سے مشورہ لیں۔",
  "پاکستان میں ریحائشی حکم کیسے حاصل کریں؟": "عدالت میں NGOs کی مدد سے درخواست دیں۔ وہ مکمل طریقہ کار سمجھاتے ہیں۔",
  "کیا میں شکایت کرتے وقت اپنا نام چھپا سکتا ہوں؟": "جی ہاں، پولیس اور NGOs گمنام شکایات کو قبول کرتے ہیں۔", 
  "ریونج پورن کا مقدمہ کیسے کریں؟": "ثبوت جمع کریں، FIA/NCCIA کو شکایت کریں، اور اگر ممکن ہو تو DRF سے قانونی مدد لیں۔",
  "گمنام شکایت کے بعد کوئی نقصان تو نہیں ہوگا؟": "نہیں، آپ کی شناخت محفوظ رکھی جاتی ہے اور آپ قانونی تحفظ کے حقدار ہیں۔",
  "کیا آن لائن دھمکی پر پولیس ایکشن لیتی ہے؟": "اگر ثبوت واضح ہوں تو FIA/NCCIA فوری کارروائی کر سکتی ہے۔",
  "کیا میری فیملی کو پتہ چلے گا؟": "اگر آپ گمنام شکایت کریں تو نہیں۔ NGOs آپ کی پرائیویسی کا احترام کرتے ہیں۔",
  "پولیس کو کیسے سمجھاؤں کہ مسئلہ سنگین ہے؟": "تمام ثبوت دکھائیں، خطرے کی شدت بیان کریں، اور NGO کی مدد سے شکایت جمع کرائیں۔",
  "آن لائن ہراسانی پر کب FIR درج ہوتی ہے؟": "جب ابتدائی انکوائری مکمل ہو اور ثبوت کافی ہوں تو FIR درج کی جاتی ہے۔",
  "FIA سائبر کرائم کا دفتر کہاں ہے؟": "پاکستان کے تمام بڑے شہروں میں FIA سائبر ونگ کے دفاتر موجود ہیں۔",
  "کیا DRF جیسے ادارے پورے پاکستان میں کام کرتے ہیں؟": "جی ہاں، DRF قومی سطح پر ہیلپ لائن اور قانونی رہنمائی فراہم کرتا ہے۔",
  "گواہوں کی ضرورت ہوگی؟": "ڈیجیٹل کیسز میں اسکرین شاٹس اور لاگز اکثر کافی ہوتے ہیں، لیکن گواہ مددگار ہو سکتے ہیں۔",
  "عدالت میں مجھے جانا پڑے گا؟": "اگر کیس عدالت تک جائے تو ممکن ہے، لیکن NGOs آپ کو گائیڈ کریں گے۔",
  "میں عدالت سے ڈرتا ہوں": "یہ عام بات ہے، NGOs اور وکلا آپ کے ساتھ ہوتے ہیں تاکہ آپ خود کو تنہا محسوس نہ کریں۔",
  "ثبوت جمع کرنے میں دیر ہو گئی ہے": "جتنے ثبوت دستیاب ہیں وہ جمع کریں، کبھی بھی رپورٹ کرنے میں دیر نہ کریں۔",
  "کیا مجرم کو فوراً گرفتار کیا جاتا ہے؟": "یہ جرم کی نوعیت اور ثبوتوں پر منحصر ہے؛ کچھ کیسز میں فوری گرفتاری ہوتی ہے۔",
  "FIA کیس پر کارروائی کب شروع کرتی ہے؟": "شکایت کے بعد ابتدائی انکوائری کے دوران کارروائی شروع ہو جاتی ہے۔",
  "آن لائن گروپس میں ہراسانی ہو رہی ہے": "گروپ چیٹ کے اسکرین شاٹس لیں اور پلیٹ فارم پر رپورٹ کریں، FIA کو بھی اطلاع دیں۔",
  "کیا سکول یا یونیورسٹی مجھے مورد الزام ٹھہرا سکتے ہیں؟": "نہیں، آپ متاثرہ ہیں۔ DRF جیسے ادارے آپ کی تعلیمی ادارے سے بات کرنے میں مدد کر سکتے ہیں۔",
  "میرے اساتذہ نے مذاق بنایا": "یہ نامناسب رویہ ہے۔ والدین، NGOs یا سکول اتھارٹی کو شکایت کریں۔",
  "خاندان نے الزام مجھ پر ڈال دیا": "یہ عام مگر غلط ردعمل ہے۔ آپ کا قصور نہیں۔ قانونی اور نفسیاتی مدد حاصل کریں۔",
  "اگر فیملی میرا فون چھین لے؟": "NGOs سے رابطہ کرنے کے دوسرے ذرائع استعمال کریں جیسے کہ دوست یا اسکول کونسلر۔",
  "والدین کہتے ہیں کوئی فائدہ نہیں ہوگا": "انہیں بتائیں کہ قانون آپ کے ساتھ ہے۔ DRF جیسے ادارے والدین کو سمجھانے میں مدد دیتے ہیں۔",
  "اگر میری شکایت جھوٹی سمجھی گئی؟": "سچ بولیں، ثبوت فراہم کریں۔ قانون سچ کو تسلیم کرتا ہے۔",
  "میں ہراسانی کا شکار ہوں لیکن ابھی شکایت نہیں کی": "جب بھی تیار ہوں شکایت کریں۔ جلدی کرنا بہتر ہے لیکن دیر سے بھی جائز ہے۔",
  "مجرم بااثر ہے": "قانون سب کے لیے برابر ہے۔ NGOs اور وکلا اس طرح کے کیسز میں خاص مدد فراہم کرتے ہیں۔",
  "آن لائن ہیٹ پیجز نے میرا مذاق اڑایا": "یہ سائبر بُلیئنگ ہے، اسکرین شاٹس لیں اور پلیٹ فارم و FIA کو رپورٹ کریں۔",
  "فیس بک یا انسٹاگرام سے مواد کیسے ہٹوائیں؟": "رپورٹ فیچر استعمال کریں، DMCA یا پرائیویسی شکایت بھی درج کریں۔",
  "ثبوت کا بیک اپ کیسے رکھیں؟": "فلیش ڈرائیو، کلاؤڈ، اور پاسورڈ سے محفوظ فولڈرز میں اسکرین شاٹس اور لاگز رکھیں۔",
  "کیا ویب سائٹ سے بھی شکایت ہو سکتی ہے؟": "جی ہاں، FIA کی آفیشل سائٹ پر آن لائن شکایت جمع کرائی جا سکتی ہے۔",
  "بچوں کی تصاویر بغیر اجازت پوسٹ کی گئی": "یہ پرائیویسی کی خلاف ورزی اور PECA سیکشن 20 کے تحت جرم ہے۔",
  "کیا میں نابالغ ہوتے ہوئے بھی قانونی کارروائی کر سکتا ہوں؟": "جی ہاں، عدالت میں نمائندہ یا NGO کی مدد سے کارروائی ہو سکتی ہے۔",
  "کیا مجرم کو جیل ہو سکتی ہے؟": "جی ہاں، PECA کے تحت سزا 3 سے 14 سال قید تک ہو سکتی ہے۔",
  "اگر مجرم بیرون ملک ہے؟": "FIA انٹرپول یا متعلقہ اتھارٹی سے تعاون کے ذریعے کارروائی کر سکتی ہے۔",
  "میرا فون قبضے میں لے لیا گیا": "NGO یا وکیل سے رابطہ کریں تاکہ آپ کی ذاتی معلومات کا تحفظ کیا جا سکے۔",
  "عدالت مجھ سے سوال کرے گی؟": "اگر کیس عدالت جائے تو گواہی دی جا سکتی ہے، وکیل آپ کو تیاری کروائیں گے۔",
  "عدالت کے عمل سے ڈر لگتا ہے": "NGOs آپ کی نمائندگی اور حوصلہ افزائی کے لیے موجود ہیں۔",
  "ریاست میرے خلاف ہو جائے گی؟": "نہیں، قانون متاثرہ کے ساتھ ہوتا ہے۔ آپ کے حقوق محفوظ ہیں۔",
  "کیا مجرم کو معافی مل سکتی ہے؟": "یہ عدالت پر منحصر ہے، لیکن سنگین جرائم میں عام طور پر معافی نہیں دی جاتی۔",
  "اگر میں غلطی سے مجرم سے رابطے میں رہا؟": "ایسا ہو سکتا ہے، ثبوت دیں کہ رابطہ مجبوری یا دھوکے سے تھا۔",
  "مجھے نہیں معلوم اگلا قدم کیا ہو؟": "DRF یا FIA سے رہنمائی لیں، وہ آپ کو ہر مرحلے پر بتائیں گے کہ کیا کرنا ہے۔",
  "NGOز کا فائدہ کیا ہے؟": "یہ ادارے قانونی، جذباتی، اور تکنیکی مدد فراہم کرتے ہیں تاکہ آپ خود کو تنہا نہ محسوس کریں۔", 
  "کیا ڈیپ فیک ویڈیوز غیر قانونی ہیں؟": "جی ہاں، اگر وہ کسی کی ساکھ یا پرائیویسی کو نقصان پہنچائیں تو یہ جرم ہے۔",
  "ڈیپ فیک کی شکایت کہاں کریں؟": "FIA/NCCIA یا DRF جیسی NGO کے ذریعے شکایت کریں۔",
  "جعلی چیٹ سکرین شاٹس کا کیا کریں؟": "اصل چیٹ اور لاگ فراہم کریں؛ عدالت فارنزک تجزیہ کرتی ہے۔",
  "کیا پرائیویٹ چیٹ لیک کرنا جرم ہے؟": "جی ہاں، یہ پرائیویسی کی خلاف ورزی ہے اور PECA کے تحت جرم ہے۔",
  "اگر مجرم کہے 'یہ تو مذاق تھا'؟": "قانون میں ہراسانی کے لیے 'مذاق' کوئی جواز نہیں ہوتا۔",
  "PECA صرف خواتین کے لیے ہے؟": "نہیں، یہ ہر پاکستانی شہری کے لیے ہے—خواہ مرد ہو، عورت یا بچہ۔",
  "کیا مجرم کو ضمانت مل سکتی ہے؟": "یہ عدالت پر منحصر ہے، لیکن سنگین جرائم میں ضمانت مشکل ہوتی ہے۔",
  "کیا سائبر جرائم میں سمجھوتہ ممکن ہے؟": "چند معمولی جرائم میں ہو سکتا ہے، لیکن ریونج پورن جیسے سنگین جرائم میں نہیں۔",
  "کیا صرف تصاویر ثبوت کافی ہیں؟": "اگر متعلقہ ہوں تو ہاں، مگر چیٹس، لاگز، اور دیگر شواہد مددگار ہوتے ہیں۔",
  "میرا کیس رد کر دیا گیا": "اعلیٰ افسران کو شکایت کریں یا DRF سے قانونی مشورہ لیں۔",
  "FIA نے شکایت نہیں سنی": "لکھ کر شکایت جمع کرائیں یا آن لائن دوبارہ درج کریں؛ NGOs مدد فراہم کر سکتی ہیں۔",
  "NGO یا وکیل کو کیس کیسے سمجھاؤں؟": "سادہ زبان میں ترتیب وار واقعہ بیان کریں؛ وہ آپ کی بات کو قانونی زبان میں ڈھالیں گے۔",
  "اگر FIR درج نہ ہو تو؟": "اعلیٰ افسران سے رابطہ کریں، درخواست دوبارہ جمع کروائیں، یا NGO کی مدد لیں۔",
  "عدالت میں ڈیجیٹل ثبوت کی اہمیت کیا ہے؟": "انتہائی اہم—ڈیجیٹل فارنزکس سے تصدیق ہوتی ہے اور ثبوت مضبوط ہوتے ہیں۔",
  "اگر چیٹ یا مواد ڈیلیٹ ہو گیا؟": "ممکنہ بیک اپ یا اسکرین شاٹس تلاش کریں؛ کچھ صورتوں میں ڈیٹا بحال ہو سکتا ہے۔",
  "کیا فیس بک/واٹس ایپ ڈیٹا فراہم کرتے ہیں؟": "جی ہاں، عدالت یا حکومتی درخواست پر، کچھ ڈیٹا فراہم کیا جا سکتا ہے۔",
  "کیا مجرم غیر ملک میں ہو تو بھی کارروائی ہو سکتی ہے؟": "جی ہاں، FIA بین الاقوامی اداروں سے رابطہ کر کے کارروائی کرتا ہے۔",
  "قانونی کارروائی کا وقت کیا ہے؟": "ہر کیس مختلف ہوتا ہے، مگر کوشش کریں کہ جلد شکایت درج کرائیں۔",
  "میری عمر کم ہے، عدالت میں کیسے جاؤں؟": "NGO آپ کے ساتھ جائے گی اور عدالت نابالغوں کے لیے خصوصی رعایت دیتی ہے۔",
  "کیا سائبر کرائم کے الگ جج ہوتے ہیں؟": "بعض شہروں میں خصوصی سائبر کرائم کورٹس موجود ہیں۔",
  "کیا عدالت آن لائن کاروائی کرتی ہے؟": "کچھ کیسز میں ویڈیو کال پر کاروائی ہوتی ہے، خاص طور پر COVID کے بعد۔",
  "میں گھر سے عدالت نہیں جا سکتا": "NGO یا وکیل آن لائن یا پراکسی نمائندگی کا بندوبست کر سکتے ہیں۔",
  "میری بہن یا دوست متاثر ہے": "اسے شکایت درج کرنے کا کہیں، یا اس کی طرف سے NGO سے مدد حاصل کریں۔",
  "NGO کتنے دن میں جواب دیتی ہے؟": "زیادہ تر فوری جواب دیتی ہیں، بعض اوقات 24–48 گھنٹوں میں۔",
  "کیا NGOز مفت میں مدد کرتی ہیں؟": "جی ہاں، DRF، AGHS، اور دیگر تنظیمیں مفت قانونی اور جذباتی مدد فراہم کرتی ہیں۔",
  "کس NGO سے رابطہ کریں؟": "Digital Rights Foundation (DRF)، AGHS Legal Aid، Rozan، Aahung جیسے ادارے مدد فراہم کرتے ہیں۔",
  "میری آن لائن چیٹس لیک ہو گئی ہیں": "یہ پرائیویسی کی خلاف ورزی ہے، FIA یا پلیٹ فارم پر رپورٹ کریں۔",
  "کیا پرائیویسی کا کوئی قانون ہے؟": "جی ہاں، PECA سیکشن 20 ذاتی معلومات کے تحفظ سے متعلق ہے۔",
  "کیا نابالغ کے کیس میں پولیس فوراً کارروائی کرے گی؟": "زیادہ امکان ہے، خاص طور پر بچوں کے تحفظ کے کیسز میں۔",
  "کیا بچوں کے لیے الگ قانون ہے؟": "جی ہاں، PECA کے علاوہ چائلڈ پروٹیکشن قوانین بھی نافذ ہیں۔",
  "کیا FIA ویڈیوز کو ہٹا سکتا ہے؟": "جی ہاں، وہ پلیٹ فارمز سے رابطہ کر کے مواد ہٹانے کی درخواست کرتے ہیں۔",
  "کیا سوشل میڈیا اکاؤنٹ بند کیا جا سکتا ہے؟": "جی ہاں، اگر وہ جعلی، ہراساں کرنے والے یا غیر قانونی سرگرمی میں ملوث ہو۔",
  "کیا FIA کال یا SMS پر جواب دیتا ہے؟": "شکایت کے درج ہونے کے بعد اکثر کال یا میسج کے ذریعے اپڈیٹ دیا جاتا ہے۔",
  "FIA کا کیس نمبر کیسے حاصل کریں؟": "شکایت جمع ہونے کے بعد آپ کو ٹریکننگ نمبر یا کیس ID دی جاتی ہے۔",
  "کیا کوئی NGO میرے ساتھ پولیس سٹیشن جا سکتی ہے؟": "جی ہاں، DRF اور AGHS جیسی تنظیمیں آپ کے ساتھ جا سکتی ہیں۔",
  "کیا میں اپنی شکایت واپس لے سکتا ہوں؟": "کچھ صورتوں میں ہاں، مگر سنگین جرائم میں عدالت اجازت دیتی ہے یا نہیں۔",
  "میری فیملی کو پولیس بلا سکتی ہے؟": "اگر آپ نابالغ ہیں یا خطرے میں ہیں تو پولیس یا NGO آپ کے والدین سے رابطہ کر سکتی ہے۔",
  "کیا فون ڈیٹا عدالت میں اہم ہوتا ہے؟": "جی ہاں، یہ بنیادی ثبوت سمجھا جاتا ہے، اسے محفوظ رکھیں۔",
  "فون ڈیٹا کا بیک اپ کیسے بنائیں؟": "گوگل ڈرائیو، iCloud، یا USB پر تمام اسکرین شاٹس اور چیٹس محفوظ کریں۔",
  "کیا پرانے اسکرین شاٹس بھی چلیں گے؟": "جی ہاں، جب تک وہ واضح اور متعلقہ ہوں۔",
  "PECA رپورٹ کہاں کریں؟": "آپ FIA سائبر کرائم ونگ، NCCIA، یا DRF جیسے اداروں کے ذریعے رپورٹ کر سکتے ہیں۔",
  "FIA کی رپورٹنگ ویب سائٹ کا لنک؟": "https://complaint.fia.gov.pk",
  "DRF ہیلپ لائن نمبر کیا ہے؟": "0800‑39393 (مفت، 9am–5pm، پیر تا جمعہ)",
  "FIA سے فون پر رابطہ کیسے کریں؟": "FIA ہیلپ لائن: 1991 یا قریبی سائبر کرائم سیل سے رابطہ کریں۔",
  "DRF واٹس ایپ نمبر کیا ہے؟": "+92‑331‑3921670",
  "FIA رپورٹ میں کیا شامل ہو؟": "نام، شناختی کارڈ نمبر، موبائل نمبر، واقعہ کی مکمل تفصیل، اسکرین شاٹس یا ویڈیوز۔",
  "DRF کو کیسے لکھیں؟": "contact@digitalrightsfoundation.pk پر ای میل کریں یا ہیلپ لائن پر کال کریں۔",
  "کیا DRF خواتین کے لیے مخصوص ہے؟": "نہیں، DRF ہر متاثرہ کو مدد فراہم کرتا ہے، خواہ مرد، عورت یا نابالغ ہو۔",
  "DRF کا دائرہ کار کیا ہے؟": "قانونی مشورہ، سائیکولوجیکل مدد، اور پولیس کے ساتھ کوآرڈی نیشن۔",
  "DRF کے ذریعے FIA کو رپورٹ کر سکتے ہیں؟": "جی ہاں، وہ آپ کی جانب سے شکایت درج کرا سکتے ہیں۔",
  "NCCIA کا کیا کردار ہے؟": "یہ نیا سائبر کرائم ادارہ ہے، PECA سیکشن 51 کے تحت 2024 میں قائم ہوا۔",
  "کیا FIA اور NCCIA مختلف ہیں؟": "FIA کے تحت ہی NCCIA کام کرتا ہے لیکن مخصوص تکنیکی اختیارات کے ساتھ۔",
  "کیا FIA کے پاس ویمن اسٹاف ہوتا ہے؟": "جی ہاں، خواتین متاثرین کی مدد کے لیے خواتین افسران موجود ہوتے ہیں۔",
  "FIA دفاتر کے اوقات کار کیا ہیں؟": "عموماً 9am سے 5pm، پیر تا جمعہ۔",
  "DRF ہفتہ یا اتوار کو دستیاب ہوتا ہے؟": "نہیں، صرف پیر تا جمعہ، 9am–5pm تک۔",
  "DRF بچوں کو مدد دیتا ہے؟": "جی ہاں، DRF نابالغ متاثرین کے لیے خصوصی پالیسی کے تحت کام کرتا ہے۔",
  "DRF کونسلنگ فراہم کرتا ہے؟": "جی ہاں، تربیت یافتہ سائیکولوجسٹ دستیاب ہوتے ہیں۔",
  "DRF والدین کو گائیڈ کرتا ہے؟": "جی ہاں، اگر آپ والدین ہیں اور بچے کے ساتھ مسئلہ ہوا ہے تو DRF رہنمائی فراہم کرتا ہے۔",
  "PECA کی سزا کتنی ہو سکتی ہے؟": "سائبر ہراسانی: 3 سال، چائلڈ پورنوگرافی: 7–14 سال، شناختی چوری: 3 سال تک۔",
  "PECA کے اہم سیکشنز کون سے ہیں؟": "سیکشن 20 (ہراسانی)، 21 (ریونج پورن)، 22 (چائلڈ پورن)، 24 (ڈیٹا مداخلت)۔",
  "کیا PECA کے تحت عورتوں کو خصوصی تحفظ حاصل ہے؟": "نہیں، لیکن FIA اور DRF خواتین کو خصوصی سہولت فراہم کرتے ہیں۔",
  "کیا واٹس ایپ میسجز ثبوت ہوتے ہیں؟": "جی ہاں، عدالت میں قابل قبول ہو سکتے ہیں، خاص طور پر اسکرین شاٹس اور بیک اپ۔",
  "کیا میں FIR کے بغیر بھی شکایت کر سکتا ہوں؟": "جی ہاں، ابتدائی انکوائری شکایت سے شروع ہوتی ہے، FIR بعد میں بنتی ہے۔",
  "کیا NGO کی مدد سے کیس مضبوط ہوتا ہے؟": "جی ہاں، وہ قانونی زبان، دستاویزات، اور عدالت میں مدد فراہم کرتے ہیں۔",
  "کیا FIA کیس کو بند کر سکتا ہے؟": "اگر ثبوت ناکافی ہوں یا شکایت واپس لے لی جائے تو ہاں۔",
  "اگر FIA کارروائی نہ کرے تو؟": "اعلیٰ افسر کو شکایت، DRF کے ذریعے فالو اپ، یا عدالت سے رجوع کریں۔",
  "کیا FIA میرا فون قبضے میں لے سکتا ہے؟": "جی ہاں، اگر وہ تحقیقات کے لیے ضروری ہو۔ آپ کا تعاون اہم ہوتا ہے۔",
  "FIA فون واپس کب کرے گا؟": "جیسے ہی فرانزک مکمل ہو جائے اور عدالت اجازت دے۔",
  "کیا FIA کے افسران خواتین سے بدتمیزی کر سکتے ہیں؟": "ایسا نہیں ہونا چاہیے۔ اگر ہو تو DRF یا عدالت کو شکایت کریں۔",
  "PECA کے علاوہ کون سے قانون لاگو ہو سکتے ہیں؟": "PPC، Juvenile Justice، خواتین تحفظ کے قوانین، اور Evidence Act۔",
  "PECA کے تحت گواہی کس کی ضروری ہوتی ہے؟": "ڈیجیٹل ثبوت اولین اہمیت رکھتے ہیں، مگر گواہ مدد کر سکتے ہیں۔",
  "PECA کیس کی سماعت کتنے وقت میں شروع ہوتی ہے؟": "یہ شکایت، انکوائری اور FIR درج ہونے پر منحصر ہے؛ اکثر 1–2 ماہ۔",
  "کیا PECA انگریزی میں ہوتا ہے؟": "جی ہاں، اصل قانون انگریزی میں ہے، مگر NGOs اردو میں وضاحت فراہم کرتے ہیں۔",
  "PECA کے متعلق اردو مواد کہاں سے ملے گا؟": "DRF، AGHS، اور FIA کے صفحات پر اردو گائیڈز دستیاب ہیں۔",
  "کیا PECA پر ویڈیوز موجود ہیں؟": "جی ہاں، DRF اور FIA کے یوٹیوب چینلز پر آگاہی ویڈیوز موجود ہیں۔",
  "کیا سکولوں میں PECA پڑھایا جاتا ہے؟": "کچھ ادارے سائبر سیفٹی سیشنز کراتے ہیں، مگر باقاعدہ نصاب میں شامل نہیں۔",
  "کیا FIA نابالغ کے کیس کو ترجیح دیتا ہے؟": "جی ہاں، بچوں کے معاملات میں تیز کارروائی کی جاتی ہے۔",
  "کیا PECA مستقبل میں اپڈیٹ ہو سکتا ہے؟": "جی ہاں، پارلیمان ترامیم کر سکتی ہے جیسے 2021 اور 2024 میں ہوئی تھیں۔",
  "کیا میں PECA کیس میں وکیل خود رکھ سکتا ہوں؟": "جی ہاں، مگر اگر آپ افورڈ نہیں کر سکتے تو NGOs مدد کر سکتے ہیں۔",
  "کیا عدالت میں خود پیش ہونا ضروری ہے؟": "اگر نمائندہ ہو تو ضروری نہیں، مگر عدالت کہے تو جانا پڑتا ہے۔",
  "PECA رپورٹ کرنے کے بعد کیا ہوگا؟": "ابتدائی انکوائری، ثبوت جمع، FIR درج، تحقیقات، اور عدالت پیشی۔",
  "اگر مجرم مجھے دھمکی دے تو؟": "فوراً FIA کو اطلاع دیں، اور ریحائشی تحفظ کے لیے عدالت سے رجوع کریں۔",
  "اگر میں ریونج پورن کا شکار ہوں؟": "تصاویر/ویڈیوز کو ہٹانے کی درخواست دیں، FIA اور DRF سے فوری رابطہ کریں۔",
  "PECA کے تحت عدالت کہاں واقع ہے؟": "ہر بڑے شہر میں سائبر کرائم عدالتیں موجود ہیں، عام طور پر FIA دفاتر کے قریب۔",
  "DRF کتنی زبانوں میں مدد دیتا ہے؟": "اردو، انگریزی، اور بعض صورتوں میں پنجابی، سندھی یا پشتو۔",
  "کیا نابالغ خود بھی رپورٹ کر سکتا ہے؟": "جی ہاں، NGO کی مدد سے یا کسی بالغ کی موجودگی میں۔",
  "کیا PECA کیسز میں میڈیا کوریج ہوتی ہے؟": "صرف عدالتی اجازت سے؛ نابالغ کیسز میں سخت رازداری رکھی جاتی ہے۔",
  "کیا DRF مردوں کو بھی سائیکولوجیکل مدد دیتا ہے؟": "جی ہاں، وہ ہر صنف کے لیے مدد فراہم کرتے ہیں۔"
}



